[{"id":"0","name":"Hogger (Hogger)","builds":[{"name":"Loot Hoard Build","skills":"[T2231113,Hogger]"}],"synergies":["Garrosh (Garrosh)","Hanzo (Hanzo)","Li-Ming (Li-Ming)","Stukov (Stukov)"],"counters":["E.T.C. (C.T.E.)","Hanzo (Hanzo)","Medivh (Medivh)","Ana (Ana)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Staggering Blow can be used to Knockback enemy Heroes into Ez-Thro Dynamite.\nEz-Thro Dynamite explodes immediately if thrown directly on enemy Heroes.\nHogg Wild can be used to quickly clear Mercenary Camps between two parallel segments of impassable terrain or, when that is not possible, with the use of Loot Hoard on one side.\nHoardapult has Vector Targeting that allows you to choose on which side of the Loot Hoard you want to land.\nShockwave is easier to use on enemy Heroes previously Slowed with Ez-Thro Dynamite and is a great setup for using Loot Hoard right behind them for getting full value from Staggering Blow right after.\nLoot Hoard can be canceled before it expires to immediately collect its Meat.\n"},{"id":"1","name":"Mei (Mei)","builds":[{"name":"Cryo-Freeze Build","skills":"[T3321234,Mei]"}],"synergies":["Xul (Xul)","Lunara (Lunara)","Jaina (Jaina)","Deckard Cain (Deckard Cain)"],"counters":["E.T.C. (C.T.E.)","Yrel (Yrel)","Hanzo (Hanzo)","Junkrat (Junkrat)","Zeratul (Zeratul)","Ana (Ana)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)"],"tips":"The moderate Slow provided by Snow Blind can be used to slightly increase the chance that Icing will hit enemy Heroes from a good angle.\nThe high but decaying Slow provided by Icing must be used to drastically increase the chance that Stun at the end of Blizzard will trigger.\nAvalanche can split the enemy team by pushing some enemy Heroes away, even behind impassable terrain.\nAfter you aggressively get behind an enemy Hero by using Icing, you can push them towards your team with Avalanche.\nIf you catch 3 enemy Heroes with Avalanche, you can follow the snowball with Icing to be in range for casting Blizzard as a follow-up to the prolonged Stun.\nIce Wall can be used to split the enemy team by putting in Time Stop some Heroes and fighting the others.\nA well-timed Blizzard will always Stun enemy Heroes affected by Ice Wall.\n"},{"id":"2","name":"Deathwing (Asa da Morte)","builds":[{"name":"Molten Flame Build","skills":"[T2132111,Deathwing]"},{"name":"Basic Attacks Build","skills":"[T1232331,Deathwing]"},{"name":"Dragonflight Build","skills":"[T1222323,Deathwing]"}],"synergies":["E.T.C. (C.T.E.)","Arthas (Arthas)","Johanna (Johanna)","Muradin (Muradin)"],"counters":["Tychus (Tychus)","Greymane (Greymane)","Valla (Valla)","Zeratul (Zeratul)","Tracer (Tracer)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)"],"tips":"Most of your damaging abilities have a significant casting delay until they hit. Take this into consideration and aim accordingly.\nDeathwing can only restore lost Armor Plates by using Dragonflight.\nOn push-heavy maps such as Tomb of the Spider Queen or Towers of Doom, Burn Beneath My Shadow at Level 10 is a good choice. Use Cataclysm shortly before a Structure is about to fall to maximize value of the talent.\nWhen fighting melee Heroes, Destroyer Form is recommended. Against ranged Heroes, World Breaker's long distance abilities have an edge.\nDespite Deathwing being such a massive combatant, it is often wiser to avoid direct combat and reposition him globally via Dragonflight and push a lane away from the enemy team.\n"},{"id":"3","name":"Qhira (Qhira)","builds":[{"name":"Heavy Bleeding Build","skills":"[T2122112,Qhira]"},{"name":"Carnage Build","skills":"[T1111111,Qhira]"},{"name":"Basic Attack Build","skills":"[T3332312,Qhira]"}],"synergies":["Uther (Uther)","Rehgar (Rehgar)","Arthas (Arthas)"],"counters":["Lúcio (Lúcio)","Muradin (Muradin)","E.T.C. (C.T.E.)"],"strongerMaps":["Dragon Shire (Condado do Dragão)","Hanamura Temple (Templo de Hanamura)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Grappling Hook pierces through Minions and Mercenaries, which allows Qhira to hit her target from many different angles.\nGrappling Hook can be used on enemy Heroes or terrain while Qhira is spinning with Revolving Sweep, granting her an astounding amount of mobility.\nWhile spinning, Revolving Sweep grants Qhira protection against crowd control effects.\nBlood Rage gets most value if activated after spreading Bleeding stacks on several enemy Heroes. Use it frequently to heal during the laning phase to prevent downtimes.\n"},{"id":"4","name":"Anduin (Anduin)","builds":[{"name":"Divine Star Build","skills":"[T3132132,Anduin]"},{"name":"Basic Attacks Build","skills":"[T3332232,Anduin]"}],"synergies":["Diablo (Diablo)","Garrosh (Garrosh)","Jaina (Jaina)","Raynor (Raynor)"],"counters":["Ana (Ana)","Illidan (Illidan)","Tracer (Tracer)","Diablo (Diablo)","Falstad (Falstad)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Leap of Faith can be used on allies already impaired by enemy crowd control or pre-emptively to prevent them from taking damage.\nCancelling Flash Heal's channel animation does not put the ability on cooldown, which allows Anduin to re-position himself and immediately start casting again.\nSafe positioning is key when playing Anduin, as he lacks any form of escape mechanism, such as dashes or teleports.\nInner Focus can be used after casting Desperate Prayer to reset Flash Heal's cooldown.\nLightbomb's Stun can be used after (or before) using Chastise's Root to trigger a strong crowd control combo.\n"},{"id":"5","name":"Imperius (Impérius)","builds":[{"name":"Molten Armor Build","skills":"[T1111223,Imperius]"}],"synergies":["Jaina (Jaina)","Fenix (Fenix)","Rehgar (Rehgar)","Mal'Ganis (Mal'Ganis)","E.T.C. (C.T.E.)","Yrel (Yrel)","Blaze (Blaze)"],"counters":["Jaina (Jaina)","Raynor (Raynor)","Sgt. Hammer (Sgt. Marreta)","Zul'jin (Zul'jin)","E.T.C. (C.T.E.)","Lúcio (Lúcio)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Molten Armor is very strong in a 1-versus-1 situation, as it focuses all of its damage on the same target.\nAngelic Armaments can be used to take down enemy Heroes, so do not hesitate to use the activatable component if you do not have to worry about getting damaged.\nCelestial Charge can be used to impale and Stun several enemies at once, however, keep in mind that Imperius cannot move during the animation.\nMolten Armor can be activated while Imperius is impaling enemies with Celestial Charge to maximize his damage output.\nStutter-stepping is crucial when playing Imperius in order to maximize Valorous Brand's damage output.\nTo improve Imperius' waveclear, use Solarion's Fire when the enemy Minion wave is lined up in a straight line.\nThe closer your target is from you, the easier it is to hit Celestial Charge. If you aim Celestial charge very close to Imperius, it will hit enemies much sooner, because there will be no time spent moving towards the enemy.\n"},{"id":"6","name":"Orphea (Orféa)","builds":[{"name":"Overflowing Chaos Build","skills":"[T3312223,Orphea]"},{"name":"Shadow Waltz Build","skills":"[T1112113,Orphea]"}],"synergies":["Arthas (Arthas)","Diablo (Diablo)","Johanna (Johanna)","Mal'Ganis (Mal'Ganis)","Varian (Varian)","Xul (Xul)"],"counters":["Anub'arak (Anub'arak)","Chen (Chen)","Genji (Genji)","Lunara (Lunara)","Muradin (Muradin)","Nova (Nova)","Tracer (Tracer)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)","Warhead Junction (Junção da Ogiva)"],"tips":"Each enemy Hero hit by Overflowing Chaos generates one Chaos, making area hits key to improving your survivability.\nShadow Waltz may be tempting to use on-Cooldown, but using it to avoid dangerous skillshots is paramount.\nChomp synergises naturally with Shadow Waltz; use the latter to dash to your intended target.\nBoth Dread's initial wave and eruption can hit a given target.\n"},{"id":"7","name":"Mal'Ganis (Mal'Ganis)","builds":[{"name":"Necrotic Embrace Build","skills":"[T1231311,MalGanis]"}],"synergies":["Jaina (Jaina)","Zeratul (Zeratul)","Malfurion (Malfurion)"],"counters":["Garrosh (Garrosh)","Hanzo (Hanzo)","Zeratul (Zeratul)","Malfurion (Malfurion)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Hanamura Temple (Templo de Hanamura)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)"],"tips":"Since his engage tools have a limited range, it is better to flank enemy Heroes.\nUsing Night Rush immediately after the third activation of Fel Claws will make it hard for the focused enemy Hero to react between the Stun and the Sleep.\nIt is advised to crowd control nearby enemy Heroes before using your Heroic Ability, so that they cannot interrupt it.\nSometimes it is useful not to use Fel Claws three times in quick succession to keep its Stun ready, to use the next activation for mobility, or to maximize your damage output by using Basic Attacks in between.\n"},{"id":"8","name":"Mephisto (Mefisto)","builds":[{"name":"Standard Lightning Nova Build","skills":"[T2222323,Mephisto]"},{"name":"Hybrid Build","skills":"[T2322213,Mephisto]"}],"synergies":["Deckard Cain (Deckard Cain)","E.T.C. (C.T.E.)","Zarya (Zarya)","Diablo (Diablo)"],"counters":["Kael'thas (Kael'thas)","Kel'Thuzad (Kel'Thuzad)","Junkrat (Junkrat)","Stitches (Suturino)","Anub'arak (Anub'arak)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Remember that Lord Of Hatred will reduce your cooldowns when planning Ability use.\nCast Skull Missile toward enemies with impaired mobility.\nKeep in mind that Lightning Nova's radius is the same as Mephisto's Basic Attack range.\nCarefully plan Shade of Mephisto use; you will return to the initial cast location after a short time.\nConsume Souls should be channelled from a safe distance, so that it can not be interrupted.\nCast Durance of Hate toward enemy Heroes who cannot move, to ensure that it will land.\nWatch for opportunities to follow-up your allies.\n"},{"id":"9","name":"Whitemane (Cristalba)","builds":[{"name":"Inquisition Build","skills":"[T1231121,Whitemane]"}],"synergies":["Johanna (Johanna)","Sonya (Sonya)","Blaze (Blaze)"],"counters":["Alarak (Alarak)","Li-Ming (Li-Ming)","Raynor (Raynor)"],"strongerMaps":[],"tips":"Make sure to apply Zeal to damaged allies before dealing damage.\nDesperate Plea is the only Ability in Whitemane's kit that has a Mana cost, but you have to manage your Mana wisely because of the Desperation mechanic.\nCast Inquisition immediately after Searing Lash to maximise your DPS.\nCast Searing Lash whenever it is available and it is safe to do so.\nScarlet Aegis can be used during team fights to apply Zeal to allies without a Desperation cost.\n"},{"id":"10","name":"Yrel (Yrel)","builds":[{"name":"Bruiser Build","skills":"[T2321314,Yrel]"},{"name":"Divine Steed Build","skills":"[T2331114,Yrel]"}],"synergies":["Garrosh (Garrosh)","Johanna (Johanna)","Maiev (Maiev)","Abathur (Abathur)"],"counters":["E.T.C. (C.T.E.)","Lúcio (Lúcio)","Raynor (Raynor)","Johanna (Johanna)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Ardent Defender is a great defensive tool against enemy burst damage. That being said, feel free to use the ability after dropping down to 50% health instead of waiting until the last moment. This ensures you can stay fighting rather than having to withdraw from combat.\nEvery of Yrel's Basic Abilities has a wind-up time. Make sure to charge up the abilities in time to gain maximum value off them in fights.\nDivine Purpose can be used to instantly cast an ability with maximum value. Use it with Vindication to gain an instant heal, with Righteous Hammer to immediately knock back enemies, and with Avenging Wrath to engage or disenage at once.\nDauntless greatly increases Yrel's survivability; use your abilities within 2 seconds between each other in order to not lose the extra armor from the Talent.\n"},{"id":"11","name":"Deckard Cain (Deckard Cain)","builds":[{"name":"Standard Build","skills":"[T3131311,Deckard]"},{"name":"Defensive Build","skills":"[T3321311,Deckard]"}],"synergies":["Alarak (Alarak)","Arthas (Arthas)","Blaze (Blaze)","Diablo (Diablo)","Jaina (Jaina)","Johanna (Johanna)","Kerrigan (Kerrigan)","Kel'Thuzad (Kel'Thuzad)","Tyrael (Tyrael)","Varian (Varian)"],"counters":["Alarak (Alarak)","Diablo (Diablo)","Kerrigan (Kerrigan)","Tracer (Tracer)","Samuro (Samuro)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Potions created by Healing Potion last until consumed. Casting Healing Potion beyond the limit of 5 will destroy the oldest Potion.\nHoradric Cube has a short flight time, but can still hit enemies running directly away from Deckard if the targeting reticle is centered\nScroll Of Sealing should naturally follow successful Horadric Cube hits.\nStay Awhile and Listen should not be used in the middle of combat, as it is likely to be interrupted. Try isolating important targets such as Healers instead.\nLorenado's vector targeting allows it to push enemies towards your teammates, and more importantly, towards Scroll of Sealing's area of effect.\n"},{"id":"12","name":"Fenix (Fenix)","builds":[{"name":"Basic Attack Build","skills":"[T2131313,Fenix]"}],"synergies":["Johanna (Johanna)","Maiev (Maiev)","Thrall (Thrall)","Diablo (Diablo)"],"counters":["Varian (Varian)","E.T.C. (C.T.E.)","Genji (Genji)","Zeratul (Zeratul)","Lúcio (Lúcio)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Cast Plasma Cutter liberally, and always try to follow it up with Basic Attacks.\nStutter-step to keep enemies near your maximum range.\nUse Shield Capacitor to trade damage with enemy Heroes. Your shields will regenerate, but their health will not.\nUse Weapon Mode: Repeater Cannon on isolated targets like Boss Mercenaries, Forts, or enemies who are out of position.\nSave Warp to escape or reposition as needed.\nCast Purification Salvo when enemies are slowed by Plasma Cutter for maximum damage.\n"},{"id":"13","name":"Maiev (Maiev)","builds":[{"name":"Standard Build","skills":"[T3112113,Maiev]"},{"name":"Cruel Chain Build","skills":"[T1212123,Maiev]"}],"synergies":["E.T.C. (C.T.E.)","Blaze (Blaze)","Jaina (Jaina)","Tassadar (Tassadar)","Deckard Cain (Deckard Cain)","Malfurion (Malfurion)"],"counters":["Arthas (Arthas)","Tyrael (Tyrael)","E.T.C. (C.T.E.)","Johanna (Johanna)","Lunara (Lunara)","Tracer (Tracer)","Lúcio (Lúcio)","Brightwing (Asaluz)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"It is often best to hold on to Fan of Knives's Cooldown to try and hit at least two Heroes than to use it at all, as its reset mechanic is very powerful.\nUsing Umbral Bind against Minions or Structures can allow you to tether Heroes that are out of melee range.\nSpirit of Vengeance can be used through walls or from vents or bushes to surprise enemies.\nRecasting Spirit of Vengeance disjoints projectiles directly targeting Maiev.\nContainment Disc pierces Minions and Structures, and is particularly useful for denying strong Heroic Abilities or simply setting up.\nVault of the Wardens allows you to pass through units, but not Structures nor terrain.\nWith Cruel Chain, Spirit of Vengeance can be used after Umbral Bind towards enemies, so it will trigger Cruel Chain's extra damage, and blink would activate pull, guaranteeing maximum damage.\nSince Bonds of Justice will only stacks on secondary enemies, try to always target a minion, mercenary, or structure with Umbral Bind to complete the quest faster.\nAgainst melee Heroes, you do not need to use your blink to get close. It is better to use Spirit of Vengeance towards them while they are marked by Umbral Bind, as it will guarantee that they take Spirit of Vengeance's damage twice.\nWarden's Cage has the same radius as Umbral Bind's pull, and therefore it should be used right after applying it. It is not necessary to move backwards in order to pull enemies into Warden's Cage, use these few seconds before the cage is active to deal damage or reposition yourself, since the enemies are already doomed into the area.\nWith practice, you will know when Fan of Knives will hit 2 targets, and Naisha's Memento can be used right before it, because the Cooldown will be refreshed.\n"},{"id":"14","name":"Blaze (Blaze)","builds":[{"name":"Oil Spill Build","skills":"[T4111111,Blaze]"},{"name":"Basic Attacks Build","skills":"[T1311111,Blaze]"}],"synergies":["Arthas (Arthas)","Kerrigan (Kerrigan)","Maiev (Maiev)","Malfurion (Malfurion)"],"counters":["Leoric (Leoric)","Lunara (Lunara)","Malthael (Maltael)","Nova (Nova)","Tracer (Tracer)","Valla (Valla)"],"strongerMaps":["Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Flame Stream actually fires two parallel projectiles; hit with both to double the Ability's damage.\nAn Ignited Oil Spill will Ignite any other Oil Spills that overlap with it.\nJet Propulsion does not collide with Minions, allowing you to charge through to hit enemy Heroes or escape without being blocked.\nYou do not have to stay inside Bunker Drop; press the R key to leave it.\nCombustion prevents you from casting other Abilities while it is being channeled.\nThe cooldown of Pyromania is reduced for each Hero hit by Flame Stream; double hits count as well.\n"},{"id":"15","name":"Hanzo (Hanzo)","builds":[{"name":"Storm Bow Build","skills":"[T1112123,Hanzo]"},{"name":"Scatter Arrow Build","skills":"[T2122123,Hanzo]"},{"name":"Basic Attack Build","skills":"[T3332133,Hanzo]"}],"synergies":["Zeratul (Zeratul)","E.T.C. (C.T.E.)","Diablo (Diablo)","Blaze (Blaze)","Johanna (Johanna)","Mal'Ganis (Mal'Ganis)"],"counters":["Genji (Genji)","Illidan (Illidan)","Zeratul (Zeratul)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Use Natural Agility as a shortcut around long walls, or to escape danger.\nUse Storm Bow to poke enemies from a safe distance.\nMove back and forth to keep enemies near Storm Bow's maximum range as it channels.\nScatter Arrow can be used to quickly dismount enemies or prevent hearthing, as it does not require channeling.\nAlways check bushes and vents with Sonic Arrow or Scatter Arrow before entering them.\nUse Dragon's Arrow when enemies are retreating in a straight line, so you make sure to hit them, enabling your team to follow up.\nDuring fights, if possible, you should only use Dragon's Arrow at the middle range of it, to stun enemies for 1,25 seconds. Use the stun to land your Basic Abilities dealing high damage to the targets.\nBullseye can be used as follow up to any crowd control, including Dragon's Arrow's stun.\n"},{"id":"16","name":"Alexstrasza (Alexstrasza)","builds":[{"name":"Gift of Life Build","skills":"[T1312332,Alexstrasza]"},{"name":"Abundance Build","skills":"[T2122332,Alexstrasza]"},{"name":"Flame Buffet Build","skills":"[T1232333,Alexstrasza]"}],"synergies":["Johanna (Johanna)","Blaze (Blaze)","Kael'thas (Kael'thas)","Azmodan (Azmodan)"],"counters":["Anub'arak (Anub'arak)","Yrel (Yrel)","Kael'thas (Kael'thas)","Sylvanas (Sylvana)","Ana (Ana)"],"strongerMaps":["Infernal Shrines (Santuários Infernais)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Gift of Life costs Health instead of Mana, so try to keep your Health high.\nAbundance should be positioned trying to predict how your team will move in the next 3 seconds and without putting them in danger to get the healing.\nFlame Buffet costs a lot of Mana, unless you hit the same target multiple times in a row, so stop using it for a dozen of seconds when you missed too many times in a row and you want to keep your Mana high.\nLife-Binder should be used on a Hero who has low Health when Alexstrasza has high Health or on a Hero who has high Health when Alexstrasza has low Health, but not when they have a similar percentage of Health.\nCleansing Flame can be used as a form of escape or as a global if you are away from your team and want to help them immediately.\nDragonqueen is an important Ability that must be used strategically, when the enemy team cannot disengage because they are committed or because there is an Objective to contest.\nBreath of Life costs no Health and no Mana, so you should usually cast it on cooldown.\nPreservation should usually be positioned aggressively, forcing the enemy team to fight in an unfavorable scenario while they try to disengage and wait for Dragonqueen to end.\nWing Buffet can be used to peel, interrupt, or even disengage if really needed.\nLife-Binder has more range while Dragonqueen is active.\nCleansing Flame has no cast time while Dragonqueen is active and can be used to extend its duration.\n"},{"id":"17","name":"Junkrat (Junkrat)","builds":[{"name":"Concussion Mine Build","skills":"[T3211223,Junkrat]"},{"name":"Steel Trap Build","skills":"[T3331323,Junkrat]"},{"name":"Frag Launcher Build","skills":"[T1141123,Junkrat]"}],"synergies":["E.T.C. (C.T.E.)","Garrosh (Garrosh)","Uther (Uther)","Malfurion (Malfurion)","Zeratul (Zeratul)"],"counters":["Illidan (Illidan)","Tracer (Tracer)","Zeratul (Zeratul)","Tyrael (Tyrael)","Genji (Genji)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)","Warhead Junction (Junção da Ogiva)"],"tips":"Be careful not to overshoot enemy targets with Frag Launcher. Aiming just in front of the desired target (on the very edge of their hitbox) will cause the bomb to bounce into them if it does not make immediate contact.\nConcussion Mine is Junkrat's primary source of self-peel. Try to not use it unwisely at the start of a fight just because it is off cooldown.\nTry to set up Steel Trap in areas of high contention just before an impending fight. The 2-second setup time makes the ability very difficult to use effectively mid-combat.\nRIP-Tire's jump ability (Q) can be used to flank or cut-off unprepared enemies behind otherwise impassable terrain.\nRocket Ride often times should be used as a \"second life\" to deny enemy experience when cast just before dying; it may even allow Junkrat to pick up a kill or two!\nUse Junkrat’s level 13 talent Ripper Air effectively to move throughout the map. Mount is slower than Ripper Air. Only use your mount if Concussion Mine is on cooldown.\nConcussion Mine and Steel Trap can be used to provide vision in bushes. On maps like Tomb of the Spider Queen, you can use Concussion Mine and Steel Trap to provide vision in the bushes between the upper turn-in point.\nDo not be trigger happy with your Concussion Mine. Just because an enemy is standing on top of it, does not mean you need to activate it. Make smart decisions regarding the use of this.\nCurrently, you can animation cancel Junkrat's Basic Attack. This is very effective in terms of wave clear where your rotation will look like this: AA -> Immediately after you see the grenade from AA pop out -> 1 Frag Launcher -> Right click to force AA -> 1 Frag Launcher -> Right click to force AA and so on. Try this out in Test Mode first to get the gist of it.\n"},{"id":"18","name":"Ana (Ana)","builds":[{"name":"Sleep Dart Build","skills":"[T2221331,Ana]"},{"name":"Biotic Grenade Build","skills":"[T1111331,Ana]"}],"synergies":["E.T.C. (C.T.E.)","Li-Ming (Li-Ming)"],"counters":["Anub'arak (Anub'arak)","Zeratul (Zeratul)","Hanzo (Hanzo)","Lúcio (Lúcio)"],"strongerMaps":["Hanamura Temple (Templo de Hanamura)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)"],"tips":"Due to her limited survivability, Ana needs to pay special attention on where she positions herself during a team fight.\nDo not wait too much for casting Nano Boost because it lasts 8 seconds.\nHold Biotic Grenade as much as possible because it can easily secure a kill or save an allied Hero.\n"},{"id":"19","name":"Kel'Thuzad (Kel'Thuzad)","builds":[],"synergies":[],"counters":[],"strongerMaps":[],"tips":""},{"id":"20","name":"Garrosh (Garrosh)","builds":[{"name":"Groundbreaker Build","skills":"[T1331123,Garrosh]"},{"name":"Bloodthirst Build","skills":"[T2331233,Garrosh]"}],"synergies":["Jaina (Jaina)","Tyrande (Tyrande)","Uther (Uther)","Malfurion (Malfurion)"],"counters":["Malthael (Maltael)","Tychus (Tychus)","Valla (Valla)","Arthas (Arthas)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Armor Up gives Garrosh an impressive amount of damage mitigation while at low Health, allowing him to stay in combat longer than most other Heroes.\nGroundbreaker can be used to knock an enemy Hero into the air before throwing them into his allies with Wrecking Ball.\nBloodthirst's self-sustain is most effective after Garrosh has suffered damage as it heals for a percentage of his missing Health.\nRemember that Wrecking Ball is not a targeted ability and will always throw the enemy closest to Garrosh when cast (including Minions and Mercenaries).\nDue to the small radius of Warlord's Challenge, it will sometimes be difficult to strike multiple Heroes with the ability. It will often times be worth using Warlord's Challenge on a single Hero should it help secure a kill and ensure a numbers advantage for Garrosh's team.\n"},{"id":"21","name":"Stukov (Stukov)","builds":[{"name":"Standard Bio-kill Build","skills":"[T2232312,Stukov]"}],"synergies":["Raynor (Raynor)","E.T.C. (C.T.E.)","Sgt. Hammer (Sgt. Marreta)"],"counters":["Anub'arak (Anub'arak)","Genji (Genji)","Uther (Uther)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)"],"tips":"Use Bio-Kill Switch primarily to heal allies affected by Healing Pathogen.\nCast Healing Pathogen onto Heroes who will spread it to as many allies as possible.\nWeighted Pustule is useful for harassment and light disengage. It can also secure kills on fleeing enemies.\nChannel Lurking Arm onto choke points, or use it to cancel channeled enemy Heroics.\nMassive Shove can be used to push enemies far away from team fights, or simply to Stun them against nearby terrain.\nUse Flailing Swipe to peel and disengage if a fight is not looking favourable for your team.\n"},{"id":"22","name":"Malthael (Maltael)","builds":[{"name":"Standard Build","skills":"[T3132314,Malthael]"},{"name":"Massacre Build","skills":"[T3121324,Malthael]"}],"synergies":["E.T.C. (C.T.E.)","Garrosh (Garrosh)","Greymane (Greymane)","Tychus (Tychus)","Medivh (Medivh)","Ana (Ana)","Malfurion (Malfurion)"],"counters":["Blaze (Blaze)","Falstad (Falstad)","Fenix (Fenix)","Lunara (Lunara)","Tracer (Tracer)","Valla (Valla)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Malthael's Basic Attacks hit enemies in a 180 degree arc; use this to maintain Reaper's Mark on as many targets as possible.\nReaper's Mark's damage also works against most non-Structure units, making it effective against Bosses and Map Objectives.\nYou can hold the default Q hotkey to repeatedly cast Soul Rip without effort.\nWraith Strike is useful for quickly avoiding impending skillshots and areas of effect.\nTormented Souls resets Wraith Strike's Cooldown on-use AND when Tormented Souls ends.\nA skull marker appears above Heroes that would die to Last Rites's damage.\nDo not be conservative with Last Rites, as it is better to guarantee a kill and get the Cooldown reduction than to hold it.\nInevitable End can be used to bait important Abilities from the enemy team, as the Cooldown is relatively low.\nDue to Shroud of Wisdom's delay, it should be activated around 1.5 seconds before going in, as most Abilities will be used on you in the first seconds. Using it too quickly might result in having reduced uptime, while taking too long might cost your life.\n"},{"id":"23","name":"D.Va (D.Va)","builds":[{"name":"Boosters Build","skills":"[T1122232,DVa]"},{"name":"Defense Matrix Build","skills":"[T1122122,DVa]"},{"name":"Big Shot Build","skills":"[T1122333,DVa]"}],"synergies":["Garrosh (Garrosh)","Maiev (Maiev)","Tassadar (Tassadar)","Anduin (Anduin)"],"counters":["E.T.C. (C.T.E.)","Malthael (Maltael)","Raynor (Raynor)","Kael'thas (Kael'thas)","Stukov (Stukov)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Boosters can be used to both engage on enemy Heroes or peel them away from allied Heroes.\nWhile using Defense Matrix, you can press the W key to redirect it or the D key to cancel it.\nYou can use Self-Destruct during Boosters to launch the exploding Mech and eventually press the Q key again to stop it whenever you want.\nTry to hit at least one enemy Hero with each cast of Big Shot in order to reduce the cooldown of Call Mech as quickly as possible, but do not go out of position to hit multiple Heroes at once.\nUse Bunny Hop to engage on enemy Heroes as the small Stun provided will help your team to follow up.\nPrefer using Micro Missiles as a follow-up to allied crowd control because moving targets will not be that easy to hit.\nHer high damage per second while in Pilot Mode can be used to quickly clear Bosses or big Monsters (such as Immortals on Battlefield of Eternity) when enemy Heroes are not nearby.\nBasic Attacks while in Mech Mode can hit multiple enemies and deal bonus damage to nearby enemies.\n"},{"id":"24","name":"Genji (Genji)","builds":[{"name":"Shuriken Build","skills":"[T1112122,Genji]"},{"name":"Swift Strike Build","skills":"[T1222122,Genji]"}],"synergies":["Jaina (Jaina)","Uther (Uther)","E.T.C. (C.T.E.)"],"counters":["Varian (Varian)","Malfurion (Malfurion)","Lunara (Lunara)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Hanamura Temple (Templo de Hanamura)","Infernal Shrines (Santuários Infernais)"],"tips":"Set up ganks using the terrain to your advantage. Both Swift Strike and Cyber Agility can be cast to cross Walls and other impassable terrain.\nChoose your targets wisely when playing Genji. Focus on executing low health targets using Swift Strike to immediately gain a cooldown reset and Mana refund for this ability.\nDeflect can be used to protect Genji against Structure damage while diving deep.\nGenji is surprisingly Mana-hungry. Try to avoid committing to a team fight while below 25% of your total Mana.\nIf used from point blank range, all three Shuriken projectiles hit the same target. However, doing so also exposes Genji to enemy counter attacks more.\n"},{"id":"25","name":"Cassia (Cássia)","builds":[{"name":"Lightning Fury Build","skills":"[T1131221,Cassia]"},{"name":"Charged Strikes Build","skills":"[T3131333,Cassia]"}],"synergies":["Li Li (Li Li)","Johanna (Johanna)","Artanis (Artanis)","Thrall (Thrall)","Jaina (Jaina)"],"counters":["Kael'thas (Kael'thas)","Gul'dan (Gul'dan)","Sgt. Hammer (Sgt. Marreta)","E.T.C. (C.T.E.)","Mal'Ganis (Mal'Ganis)","Johanna (Johanna)"],"strongerMaps":[],"tips":"Cast Lightning Fury perpendicularly toward enemy Gates to damage all of the Structures connected to the Gate.\nUse Fend to assist with waveclear, execute low Health enemies, or to follow up Ball Lightning.\nUse Ball Lightning to duel enemy Heroes in melee range, or during team fights when enemies are clumped together.\nAvoidance will benefit you any time you are moving, and will persist while stutter stepping.\nValkyrie is a great tool for pickoffs or interrupting channeled Heroic Abilities, due to its very low cooldown.\nWar Matron can be used to mitigate some premeditated Abilities, like Flamestrike or Pyroblast, use Fend on a nearby minion to protect yourself.\n"},{"id":"26","name":"Probius (Sondius)","builds":[{"name":"Warp Rift Build","skills":"[T2222324,Probius]"},{"name":"BGuy Build","skills":"[T3331321,Probius]"}],"synergies":["E.T.C. (C.T.E.)","Diablo (Diablo)","Anub'arak (Anub'arak)","Arthas (Arthas)","Malfurion (Malfurion)"],"counters":["Kerrigan (Kerrigan)","Alarak (Alarak)","Zeratul (Zeratul)","Tracer (Tracer)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Unlike mounts, Worker Rush may be used in combat. Keep in mind that ALL damage (including damage-over-time such as poisons) will immediately break the effect.\nPlace Pylons from Warp In Pylon within brush or behind terrain or allied fortification to protect them from being immediately destroyed.\nDo not be afraid to poke enemies with Disruption Pulse when unable to set up or waiting on the cooldown of Warp Rift.\nWarp Rift is most effective when used in narrow corridors and chokepoints that force enemies to travel through its AoE.\nPhoton Cannon is great for zoning as well as soaking damage from Minions, Mercenaries, and enemy structures.\nSave Pylon Overcharge for teamfights surrounding important Battleground objectives. This will force the enemy to either stay within its range or give up the objective to disengage, either of which are good for Probius and his allies.\nInstead of simply placing Null Gate across a pathway to block it off, Null Gate can be angled slightly (depending on the space) to maximize the distance an enemy will be forced to travel through it.\n"},{"id":"27","name":"Lúcio (Lúcio)","builds":[],"synergies":[],"counters":[],"strongerMaps":[],"tips":""},{"id":"28","name":"Valeera (Valira)","builds":[{"name":"Sinister Strike Build","skills":"[T4112314,Valeera]"},{"name":"Limpanjo Build","skills":"[T4112124,Valeera]"}],"synergies":["Garrosh (Garrosh)","E.T.C. (C.T.E.)","Thrall (Thrall)","Jaina (Jaina)","Abathur (Abathur)"],"counters":["E.T.C. (C.T.E.)","Arthas (Arthas)","Medivh (Medivh)","Lúcio (Lúcio)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Sky Temple (Templo Celeste)","Warhead Junction (Junção da Ogiva)"],"tips":"Only use Blade Flurry for PvE purposes or if you started a combo with Ambush, or you will run out of energy very quickly.\nThe Unrevealable portion of Vanish allows Valeera to pass through other units, and may be used mid-fight to trick enemies with new positioning.\nDo not hesitate to use Sinister Strike to dodge powerful enemy skillshots or even to disengage from a losing fight.\nResist the temptation to use Cheap Shot to lock down enemies. This ability is mainly used for the blind. It is better to use Garrote to crowd control.\nTry to use Eviscerate when 3 Combo Points are available to maximize its damage output.\nThe Silence portion of Garrote can be used to interrupt an enemy's channeled ability.\nDo not be afraid to use Cloak of Shadows liberally, as the cooldown is rather short for a Heroic Ability. In 1v1 scenarios, Cloak of Shadows should be used just as Garrote's silence ends, so enemies cannot interrupt your damage with abilities.\n"},{"id":"29","name":"Zul'jin (Zul'jin)","builds":[{"name":"Twin Cleave Build","skills":"[T3121221,Zuljin]"},{"name":"Basic Attack Build","skills":"[T3131231,Zuljin]"}],"synergies":["Tyrael (Tyrael)","E.T.C. (C.T.E.)","Tassadar (Tassadar)","Uther (Uther)","Medivh (Medivh)","Arthas (Arthas)"],"counters":["E.T.C. (C.T.E.)","Dehaka (Dehaka)","Diablo (Diablo)","The Butcher (O Açougueiro)","Zeratul (Zeratul)"],"strongerMaps":[],"tips":"The damage caused to Zul'jin by activating Berserker can be used to help him attain his bonus attack speed much faster, however try to never abuse Berserker to the point of leaving Zul'jin with low health in a potentially compromising position.\nGrievous Throw will only strike and mark the first two enemies it comes into contact with. When intending to hit an enemy Hero, Zul'jin should avoid casting Grievous Throw at Heroes buried behind enemy minions, mercenaries, or structures.\nBecause Twin Cleave always travels the same distance in a circular motion, Zul'jin can cast it at an angle to strike enemies close to him who would otherwise avoid its pathing.\nMake sure to find a safe stop to take cover before channeling Regeneration as damage will interrupt it's effect (this includes aggro on those pesky lane minions!)\nAlthough Zul'jin will get the most value from casting Taz'dingo! at low Health, it may sometimes be a wiser play to cast Taz'dingo preemptively to avoid enemy ability combos that would otherwise result in certain death.\nThere is a slight delay when casting Guillotine, therefore Zul'jin should keep an eye the target's movement path and aim the ability accordingly.\n"},{"id":"30","name":"Ragnaros (Ragnaros)","builds":[{"name":"Empower Sulfuras Build","skills":"[T1231113,Ragnaros]"},{"name":"Blast Wave Build","skills":"[T3232234,Ragnaros]"}],"synergies":["E.T.C. (C.T.E.)","Hanzo (Hanzo)","Kael'thas (Kael'thas)","Ana (Ana)"],"counters":["Garrosh (Garrosh)","Chen (Chen)","Lunara (Lunara)","Jaina (Jaina)","Stukov (Stukov)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Empower Sulfuras resets your Basic Attack, so use it immediately after a Basic Attack to maximize your damage output.\nLiving Meteor works best against Heroes that are running in a specific direction, such as during chases or escapes.\nBlast Wave can be used on allied Heroes to help them disengage when in danger or even engage when appropriate.\nTo hit enemy Heroes with its center, Sulfuras Smash should be used as a follow up to any crowd control effect.\nGenerally speaking, Lava Wave should be used around x:22 or x:52 Game Time to catch the Experience of enemy Minions that will spawn near the enemy Core as it gets there.\nAfter losing a Boss or an Objective, Molten Core should not be used to absorb damage directed towards your Structures because it would decrease its duration, but to deal damage to them before they can even hit you.\n"},{"id":"31","name":"Varian (Varian)","builds":[{"name":"Taunt Build","skills":"[T2121234,Varian]"},{"name":"Colossus Smash Build","skills":"[T3221234,Varian]"},{"name":"Twin Blades Build","skills":"[T3322234,Varian]"}],"synergies":["E.T.C. (C.T.E.)","Blaze (Blaze)","Li-Ming (Li-Ming)","Tyrande (Tyrande)"],"counters":["E.T.C. (C.T.E.)","Arthas (Arthas)","Lunara (Lunara)","Medivh (Medivh)","Rehgar (Rehgar)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Hanamura Temple (Templo de Hanamura)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)","Warhead Junction (Junção da Ogiva)"],"tips":"When playing Taunt Build, remember that Taunt can be used to interrupt enemy channels (for example to stop Carrion Swarm by Mal'Ganis).\nWhen going for Colossus Smash Build, always make sure to use Colossus Smash first and other Abilities after in order to increase all damage dealt thanks to the Armor reduction on the enemy Hero.\nWhen choosing Twin Blades, do not go too far from your team so that they can focus the same enemy Hero as you and/or help you to survive.\nIf your team desperately needs a Tank, do not insist on taking Colossus Smash or Twin Blades of Fury at Level 4 because a Tank is really important to have in team.\n"},{"id":"32","name":"Samuro (Samuro)","builds":[{"name":"Illusion Master Build","skills":"[T1132334,Samuro]"},{"name":"Burning Blade Build","skills":"[T1112312,Samuro]"},{"name":"Bladestorm Build","skills":"[T2131323,Samuro]"}],"synergies":["Abathur (Abathur)","Deckard Cain (Deckard Cain)","Malfurion (Malfurion)","Sylvanas (Sylvana)"],"counters":["E.T.C. (C.T.E.)","Lúcio (Lúcio)","Yrel (Yrel)","Cassia (Cássia)","Jaina (Jaina)","Orphea (Orféa)","Medivh (Medivh)","Sonya (Sonya)","Diablo (Diablo)","Stukov (Stukov)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Towers of Doom (Torres da Perdição)"],"tips":"Hearth Trick: Mirror Image can be used to heal in an unconventional way. When you are outside of combat, hold Left-Shift and cast Image Transmission on a Mirror Image while channeling Hearthstone. If the Mirror Image is still alive when Hearthstone's channel completes, you will instantly return to lane with the health restoration provided by the Hall of Storms.\nClones' initial focus or movement can be controlled prior to Level 10, by using an Attack-Move command in the same moment they are created (This can be done by holding the button during the Mirror Image usage).\nUse Mirror Image to tank tower shots while ganking, or to damage structures without a friendly minion wave.\nCritical Strike resets your Basic Attacks; activate it immediately after delivering a Critical Strike for optimal effect.\nWind Walk can be used to quickly approach enemies, or to help you escape dangerous situations. Remember the cooldown starts ticking as soon as the ability is activated\nUse Bladestorm to clear waves or to deal some AoE damage in fights, when enemy has no crowd controls available.\nThe Movement Speed provided by Image Transmission can be used not only to chase, but to dodge or to disengage from combat as well.\nActivate Image Transmission to engage on a Hero near one of your Images, or to reposition to safety when you are in danger.\n"},{"id":"33","name":"Zarya (Zarya)","builds":[{"name":"Particle Grenade Build","skills":"[T1312424,Zarya]"},{"name":"Basic Attacks Build","skills":"[T3322424,Zarya]"}],"synergies":["Garrosh (Garrosh)","Sonya (Sonya)","Valla (Valla)","Malfurion (Malfurion)"],"counters":["Mal'Ganis (Mal'Ganis)","Yrel (Yrel)","Lunara (Lunara)","Tassadar (Tassadar)","Auriel (Auriel)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Hanamura Temple (Templo de Hanamura)"],"tips":"Particle Grenade should be fired when at high Energy to deal more damage or to interrupt enemies who are channeling an Objective.\nPersonal Barrier can be used to absorb damage from Structures in order to quickly fill your Energy.\nTry to anticipate incoming damage when using Shield Ally and Personal Barrier to maximize your Energy gain.\nYou can use Expulsion Zone to block an enemy Hero in a corner.\nGraviton Surge requires you to predict how enemy Heroes move, else it will miss them.\nZarya lacks mobility, therefore it is important to have a good position when enemy Heroes are nearby or missing.\nZarya's Basic Attacks hit all enemies in a straight line and therefore should be used to hit multiple Minions or Mercenaries when possible.\n"},{"id":"34","name":"Alarak (Alarak)","builds":[{"name":"Standard Build","skills":"[T2332212,Alarak]"},{"name":"Overwhelming Power Build","skills":"[T1322112,Alarak]"},{"name":"Lightning Surge Build","skills":"[T3232224,Alarak]"}],"synergies":["Raynor (Raynor)","Jaina (Jaina)","E.T.C. (C.T.E.)","Garrosh (Garrosh)"],"counters":["E.T.C. (C.T.E.)","Johanna (Johanna)","Deathwing (Asa da Morte)","Medivh (Medivh)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Towers of Doom (Torres da Perdição)"],"tips":"Use Discord Strike to Silence and damage your enemies, leaving them vulnerable.\nYou can self cast Telekinesis to propel yourself forward, into the direction Alarak is facing. Use this to confirm a kill, or push yourself to safety.\nLightning Surge has low mana cost, and is a great way to recover small amounts of Health as needed. Always try to hit enemies with the center of its beam for extra damage.\nDeadly Charge can be channeled for a small duration, allowing you to use it quickly in a teamfight, but still dealing all the damage. This is recommended to be done when enemies can easily punish you after you dive in, considering you will not lunge to the middle of enemy team by using it quickly.\nBe aware that you will lose all your Sadism on death, so even though a game is looking easy, it can easily backfire if you lose your stacks. In many situations it might be better to just abandon allies in a bad situation, instead of trying to help them and risking your own life.\nMake whatever choices will help you establish dominance; even if that means sacrificing some of Sadism's bonus damage for utility options.\n"},{"id":"35","name":"Auriel (Auriel)","builds":[{"name":"Ray of Heaven Build","skills":"[T4332114,Auriel]"}],"synergies":["Diablo (Diablo)","Xul (Xul)","Raynor (Raynor)","Tassadar (Tassadar)"],"counters":["Anub'arak (Anub'arak)","Chen (Chen)","Junkrat (Junkrat)","Chromie (Crona)","Deckard Cain (Deckard Cain)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Hanamura Temple (Templo de Hanamura)"],"tips":"Be careful when casting Sacred Sweep because it locks you in place for 0.625 seconds.\nTry to get the most value out of your Energy by casting Ray of Heaven on at least two allied Heroes.\nA well-timed Detainment Strike is a powerful peeling tool even if it does not trigger the Stun but only knocks back enemy Heroes.\nQuickly switch Bestow Hope to another Hero when the current one is not able to deal damage for any reason.\nDo not use Crystal Aegis at the last moment, but use it to prevent a big chunk of damage.\nResurrect only if the zone is safe, else you will end up giving free Experience to the enemy team and wasting your Heroic Ability, if you do not get interrupted in the first place.\n"},{"id":"36","name":"Gul'dan (Gul'dan)","builds":[{"name":"Corruption Build","skills":"[T3331421,Guldan]"},{"name":"Drain Life Build","skills":"[T2121231,Guldan]"},{"name":"Anti-melee Fel Flame Build","skills":"[T1331411,Guldan]"}],"synergies":["E.T.C. (C.T.E.)","Malfurion (Malfurion)","Auriel (Auriel)"],"counters":["Illidan (Illidan)","Greymane (Greymane)","Kerrigan (Kerrigan)","Tracer (Tracer)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)","Alterac Pass (Garganta de Alterac)"],"tips":"Try to avoid putting Gul'dan in vulnerable situations with low Health by over using Life Tap. Health can always be tapped for Mana, but once it has been there is no sure way of getting it back; particularly when Drain Life is on cooldown.\nFel Flame's short cooldown allows it to be used in quick succession; take advantage of this to burn down waves of minions and your opponents.\nDrain Life is most effective when cast on an enemy Hero under the effects of crowd control as it will be harder for them to escape its cast range.\nCorruption is incredibly effective when cast on opponents traveling through a choke-point.\nHorrify can be used to split and isolate enemy opponents. Try to target the epicenter between your target of focus and the remainder of their team.\n"},{"id":"37","name":"Medivh (Medivh)","builds":[{"name":"Standard Build","skills":"[T3222222,Medivh]"}],"synergies":["Illidan (Illidan)","Greymane (Greymane)","Genji (Genji)","Tracer (Tracer)","Diablo (Diablo)","Stitches (Suturino)"],"counters":["Gul'dan (Gul'dan)","Lunara (Lunara)","Garrosh (Garrosh)","Malfurion (Malfurion)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Sky Temple (Templo Celeste)"],"tips":"Raven Form is a formidable scouting tool that can allow your team to intercept enemy Heroes.\nPortal can be used aggressively to chase down enemy Heroes and initate team fights from an unexpected angle. It can also be used defensively to help allied Heroes escape.\nLey Line Seal can be the ideal foundation for other AoE abilities to follow up on. It can also be used to steal Mercenary or Boss Camps if all enemy Heroes are trapped inside.\nPoly Bomb can be a great tool to punish aggressive enemy Assassins, such as Tracer or Genji.\n"},{"id":"38","name":"Chromie (Crona)","builds":[{"name":"Dragon's Breath Build","skills":"[T2222332,Chromie]"},{"name":"Sand Blast Build","skills":"[T3231313,Chromie]"}],"synergies":["Johanna (Johanna)","Ana (Ana)","Malfurion (Malfurion)"],"counters":["Illidan (Illidan)","Diablo (Diablo)","Zeratul (Zeratul)","Tracer (Tracer)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Time Trap can sometimes be manually activated to prevent damage on allied Heroes as well.\nSlowing Sands is most efficient on narrow choke points, especially near Map Objectives.\nDo not be afraid to miss Sand Blast. It is better to cast this ability too often rather than to wait too long.\n"},{"id":"39","name":"Tracer (Tracer)","builds":[{"name":"Standard Build","skills":"[T1233222,Tracer]"}],"synergies":["Tassadar (Tassadar)","Jaina (Jaina)","Gul'dan (Gul'dan)","Kael'thas (Kael'thas)","Malfurion (Malfurion)","Anduin (Anduin)","Abathur (Abathur)"],"counters":["Varian (Varian)","Diablo (Diablo)","Medivh (Medivh)","Raynor (Raynor)","Sgt. Hammer (Sgt. Marreta)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)","Warhead Junction (Junção da Ogiva)"],"tips":"Use Blink to close distance on enemies, dodge Abilities, or escape danger.\nIf you have not already, set Blink's Quick Cast to \"on\" (under Settings, Hotkeys, Quick Cast Setting). This will make the Ability much more responsive, which will help you to avoid skillshots with it.\nUse Melee to deal burst damage to enemy Heroes and quickly charge Pulse Bomb. Melee can also be used to assist with waveclear as needed.\nTracer can safely overextend thanks to Recall. Use this to kill low Health enemies, who may be too dangerous to reach for your allies.\nActivate Recall to remove negative effects before other enemy Heroes are able to follow-up with Silences or Stuns.\nUse Tracer's extremely high attack speed from Reload to quickly clear units that do not have Health, but take a certain number of Basic Attacks. Examples include Doubloon Chests or Cocoon.\nUse Tracer's life steal to sustain yourself. Even if you cannot hit Heroes, it is good to retreat and attack minions or structures to get your health back.\nEven thought Tracer's basic abilities cannot reveal targets, Pulse Bomb can be used over a stealth Hero to finish or reveal them.\n"},{"id":"40","name":"Dehaka (Dehaka)","builds":[{"name":"Standard Build","skills":"[T2311311,Dehaka]"},{"name":"Enhanced Agility Build","skills":"[T3311111,Dehaka]"},{"name":"Dark Swarm Build","skills":"[T1332222,Dehaka]"}],"synergies":["Anub'arak (Anub'arak)","Jaina (Jaina)","Hanzo (Hanzo)","Maiev (Maiev)"],"counters":["Valla (Valla)","Raynor (Raynor)","E.T.C. (C.T.E.)","Sgt. Hammer (Sgt. Marreta)","Lúcio (Lúcio)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Use Dark Swarm to walk through enemies or teammates who are in your way; however, be mindful that you cannot body-block enemies while it is active.\nDrag enemies out of position, under your turrets, or into the Abilities of your allies.\nDo not use Drag instantly when enemy gets in range for it, or they will probably dodge. We recommend walking towards the hero while weaving Basic Attacks to only use Drag when you are almost sure you are going to hit.\nMaximize your map presence by evaluating options for Brushstalker before it is off cooldown.\nTry to have Essence Collection full and available for team fights. For healing outside of team fights you can fountain or hearthstone; use Brushstalker to get back into action quickly.\nUse Isolation on key assassins or supports to get the most out of it.\n"},{"id":"41","name":"Xul (Xul)","builds":[{"name":"Scythe Build","skills":"[T1332113,Xul]"},{"name":"Cursed Strikes Build","skills":"[T1211221,Xul]"},{"name":"Bone Prison Build","skills":"[T1332333,Xul]"}],"synergies":["Tyrande (Tyrande)","Medivh (Medivh)","Li-Ming (Li-Ming)","Falstad (Falstad)"],"counters":["E.T.C. (C.T.E.)","Johanna (Johanna)","Jaina (Jaina)","Sgt. Hammer (Sgt. Marreta)","Auriel (Auriel)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Cursed Strikes is one of the best waveclear Abilities in the game, so you should always be attempting to clear a wave and instantly Mount up and rotate to another lane, getting maximum value out of Raise Skeleton.\nSince Xul does not have a strong early game, sometimes it is better to (in some maps) avoid fighting for the first Objective (Infernal Shrines and Cursed Hollow can be good examples), and instead proceed to the opposite lane in order to split-push between the other 2 lanes. A good practice is to warn your team before doing this, given they will be having a numerical disadvantage in the fight, and will have to play it safe.\nKeep in mind Xul has limited mobility, so during fights it is a good idea to wait for your tank to engage, or for enemy heroes to spend their crowd control before going in, given you will struggle to enter and escape fights.\nA good way to use Bone Prison is on a tank just after they spent their defensive skills, a Johanna without Iron Skin or an Anub'arak without Burrow Charge often turn out to be an easy kill, given they will be rooted in the same place for 2 seconds.\nSince Bone Prison has a tiny range, it is recommended to always stay mounted so you can easily find a way to engage your desired target.\n"},{"id":"42","name":"Li-Ming (Li-Ming)","builds":[{"name":"Standard Build","skills":"[T2232123,Li-Ming]"},{"name":"Artillery Build","skills":"[T2222333,Li-Ming]"}],"synergies":["Arthas (Arthas)","E.T.C. (C.T.E.)","Johanna (Johanna)","Malfurion (Malfurion)","Valeera (Valira)","Varian (Varian)","Xul (Xul)"],"counters":["Anub'arak (Anub'arak)","Chen (Chen)","Genji (Genji)","Samuro (Samuro)","Tracer (Tracer)","Valeera (Valira)","Zeratul (Zeratul)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Cursed Hollow (Clareira Maldita)","Infernal Shrines (Santuários Infernais)"],"tips":"Magic Missiles should nearly always be cast on-Cooldown due to their low Cooldown and Mana cost.\nDo not hesitate to cast Arcane Orb even if you do not fully benefit from the range bonus; waiting for the perfect opportunity might cost you more overall DPS than a far hit.\nAggressively using Teleport to secure kills is not a bad idea due to Critical Mass and the profusion of strong Talents that affect the Ability.\nDisintegrate deals less damage than your other Abilities, despite being a Heroic Ability, and should be used last in your rotation due to its long range and reliability.\nConsider picking Wave of Force if your opponent's team composition feature strong channeled-abilities or tend to dive a specific target.\n"},{"id":"43","name":"Greymane (Greymane)","builds":[{"name":"Attack Build","skills":"[T3211323,Greymane]"},{"name":"Worgen Build","skills":"[T3131234,Greymane]"}],"synergies":["Abathur (Abathur)","E.T.C. (C.T.E.)","Garrosh (Garrosh)","Tyrael (Tyrael)","Uther (Uther)","Rehgar (Rehgar)","Malthael (Maltael)"],"counters":["Arthas (Arthas)","Brightwing (Asaluz)","Johanna (Johanna)","Muradin (Muradin)","The Butcher (O Açougueiro)","Uther (Uther)","Xul (Xul)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Use Minions, Summons and Structures to trigger Gilnean Cocktail's increased cone damage against Heroes.\nInner Beast's duration can be increased by attacking anything — not just Heroes.\nRazor Swipe is useful for quickly avoiding skillshots and area of effect Abilities.\nA marker appears above Heroes that would die to Go for the Throat's damage.\nCursed Bullet is worth using against Tanks early on in any given fight due to its high damage and short Cooldown.\nDarkflight's Cooldown runs while Greymane is in Worgen form. Cursed Bullet can be used during that form to become Human, allowing Greymane to instantly use Darkflight again.\nGreymane gets 10 Armor during Worgen form. Use it to take less damage from unavoidable spells, like Pyroblast.\nIf you are not in Melee range from your target, Go for the Throat can be used to give you 1-4 frames of unstoppable, removing blinds affecting you.\nDuring a blind, you cannot refresh Inner Beast's duration through Basic Attacks. At that moment, you should use an Ability to not lose the Attack Speed buff (assuming you picked Viciousness at Level 1).\n"},{"id":"44","name":"Lunara (Lunara)","builds":[{"name":"Standard Auto Attack Build","skills":"[T1312243,Lunara]"}],"synergies":["Arthas (Arthas)","Muradin (Muradin)","Jaina (Jaina)"],"counters":["Illidan (Illidan)","Genji (Genji)","Malfurion (Malfurion)","Stukov (Stukov)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)"],"tips":"The fact that Lunara cannot use a mount is a both blessing and curse. In team fights, make sure to use your increased Movement Speed to kite enemy Heroes. Out of combat, do not forget about informing your allies about your position during rotations if you are falling behind.\nLeaping Strike is a great escape mechanism against hard-engaging Tanks and melee Assassins like Illidan or Muradin.\nLunara's efficiency sometimes depends on the type of Healer Hero the enemy team chose during draft. While she counters single-target Healers like Lt. Morales or Uther, her AoE damage over time gets countered by strong AoE Healers like Stukov or Malfurion.\nOn larger maps, Hippity Hop allows Lunara to rotate as fast as any mounted Hero, which greatly helps her to stay close to her allies.\n"},{"id":"45","name":"Cho (Cho)","builds":[{"name":"Standard Build","skills":"[T2331211,Cho]"},{"name":"Basic Attacks Build","skills":"[T1321211,Cho]"},{"name":"Surging Fist Build","skills":"[T2131231,Cho]"}],"synergies":["Alexstrasza (Alexstrasza)","Ana (Ana)","Auriel (Auriel)","Brightwing (Asaluz)","Yrel (Yrel)","Blaze (Blaze)"],"counters":["Anub'arak (Anub'arak)","Garrosh (Garrosh)","Greymane (Greymane)","Imperius (Impérius)","Kharazim (Kharazim)","Leoric (Leoric)","Malthael (Maltael)","Raynor (Raynor)"],"strongerMaps":["Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Surging Fist can be interrupted; be careful when casting it near opponents with crowd control.\nConsuming Blaze heals for each enemy hit; hit as many as possible with the Ability, and then try and attack an ignited target to gain even more healing.\nRune Bomb's slow travel time makes it much more effective at short range. Be sure to call out your cast for Gall to detonate the bomb.\nUpheaval has a short cast time, and pulls opponents behind your position; be sure to account for these factors.\nHammer of Twilight is an excellent tool for quickly interrupting opponents.\nOgre Hide should be active whenever you are about to take a significant amount of damage.\n"},{"id":"46","name":"Gall (Gall)","builds":[{"name":"Dread Orb Build","skills":"[T2132314,Gall]"}],"synergies":["Alexstrasza (Alexstrasza)","Ana (Ana)","Auriel (Auriel)","Brightwing (Asaluz)","Yrel (Yrel)","Blaze (Blaze)"],"counters":["Anub'arak (Anub'arak)","Garrosh (Garrosh)","Greymane (Greymane)","Imperius (Impérius)","Kharazim (Kharazim)","Leoric (Leoric)","Malthael (Maltael)","Raynor (Raynor)"],"strongerMaps":["Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Shadowflame is by far your highest source of damage. Use it whenever it is off-Cooldown, and take advantage of the fact that it deals its damage instantly.\nDread Orb has an extremely long range; using it against nearby Structures whenever there are no better targets is an effective way of maximising its potential.\nRunic Blast requires you to be well-coordinated with your Cho partner; ask them to let you know whenver they use Rune Bomb, or pay close attention to Cho's \"Bomb's out!\" shout.\nTwisting Nether works particularly well with Cho's Upheaval; try and use them together. Use the Ability's movement speed reduction effect to keep enemies within attack range.\nShadow Bolt Volley can be difficult to aim, especially if Cho is not prepared for it; let them know ahead of time!\nShove is extremely useful for avoiding dangerous skillshots and area of effect Abilities.\nBe mindful when activating Ogre Rage in combat, as it leaves Cho 25% less resilient than he would otherwise be.\n"},{"id":"47","name":"Artanis (Artanis)","builds":[{"name":"Shield Overload Build","skills":"[T2321423,Artanis]"},{"name":"Blade Dash Build","skills":"[T2311123,Artanis]"},{"name":"Basic Attacks Build","skills":"[T3321433,Artanis]"},{"name":"Twin Blades Build","skills":"[T2331213,Artanis]"}],"synergies":["Garrosh (Garrosh)","Arthas (Arthas)","Kael'thas (Kael'thas)","Lunara (Lunara)","Medivh (Medivh)","Malfurion (Malfurion)"],"counters":["E.T.C. (C.T.E.)","Arthas (Arthas)","Varian (Varian)","Jaina (Jaina)","Lunara (Lunara)","Li Li (Li Li)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Hanamura Temple (Templo de Hanamura)"],"tips":"Use Blade Dash to reduce the cooldown of Shield Overload, to finish off enemy Heroes, or to deal damage when affected by Blind.\nDo not spam Twin Blades because it is your only gap-closer and your main tool to reduce the cooldown of Shield Overload.\nUse Phase Prism during Blade Dash to surprise an enemy Hero with this displacement combo.\nActively watch the cooldown of Shield Overload to decide when to use Twin Blades, Blade Dash, or just Basic Attacks.\nUse Suppression Pulse just as you enter a large team fight to reduce the damage that you and your allied Heroes will take.\nUse Purifier Beam on enemy Heroes with low mobility, else it goes wasted.\n"},{"id":"48","name":"Lt. Morales (Ten. Morales)","builds":[{"name":"Healing Beam Build","skills":"[T1121224,LtMorales]"}],"synergies":["Johanna (Johanna)","Raynor (Raynor)"],"counters":["Garrosh (Garrosh)","Chen (Chen)","Chromie (Crona)","Lunara (Lunara)","Auriel (Auriel)"],"strongerMaps":["Hanamura Temple (Templo de Hanamura)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)"],"tips":"Healing Beam can heal Lt. Morales thanks to Caduceus Feedback without consuming Energy if the healed target is currently at full Health.\nWhen healing a Hero, especially if melee, try to synchronize your movement with theirs to avoid going out of position and get focused down by the enemy team.\nDo not use Safeguard in random moments but instead try to cast it when it will mitigate a good amount of damage.\nYou can reactivate Displacement Grenade to make it detonate immediately rather than at its maximum range.\nWhile the best targets for Stim Drone are marksmen, you can occasionally use it on Heroes from different Roles when they need Movement Speed to chase or escape.\nA short range Medivac Dropship can protect yourself from danger without leaving your team without their Healer for too much time.\n"},{"id":"49","name":"Rexxar (Rexxar)","builds":[{"name":"Basic Attacks Build","skills":"[T1232232,Rexxar]"}],"synergies":["Johanna (Johanna)","Jaina (Jaina)","Malfurion (Malfurion)"],"counters":["Qhira (Qhira)","Zeratul (Zeratul)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Considering his unique design, it is advised to familiarize with the unique way to control Misha by spending some minutes in Try Mode before playing a match as Rexxar.\nUse [Alt + D] to self-cast Misha, Focus! and quickly call Misha to your side.\nMisha can be an excellent tool to intercept enemy Abilities that were originally aimed at Rexxar or a vulnerable ally.\n"},{"id":"50","name":"Kharazim (Kharazim)","builds":[{"name":"Radiant Dash Build","skills":"[T2212124,Kharazim]"},{"name":"Breath of Heaven Build","skills":"[T2222333,Kharazim]"}],"synergies":["Garrosh (Garrosh)","E.T.C. (C.T.E.)","Anub'arak (Anub'arak)","Genji (Genji)"],"counters":["Johanna (Johanna)","Auriel (Auriel)","Medivh (Medivh)","Uther (Uther)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Hanamura Temple (Templo de Hanamura)","Sky Temple (Templo Celeste)"],"tips":"Radiant Dash can be used on your Elemental Allies (even over Walls and other unpassable terrain) in order to escape pursuing enemies.\nAvoid smashing your Q-button too quickly when playing Kharazim, as it may cause Radiant Dash to use both charges on the same target.\nDo not use any healing or shielding abilities on the target you used Divine Palm on before it gets triggered.\nDuring team fights, especially in the later stages of the game, it is often better to use Radiant Dash on allies in order to heal them and reposition yourself.\nIt is incredibly important to wait for the right moment before you use Seven-Sided Strike. Ideally, you want to focus its damage on one enemy only to unfold all its damage on the same target. It is good to wait for the target to be immobile to dash towards a point in which your ult will only hit that specific target.\nUse your Earth Ally very early into the fight, since it has a long duration and will mitigate much damage.\nBoth Quicksilver and Cleansing Touch can be used either as a peeling Ability, or as an engage tool. By dashing towards your tank, you will be enabling an unstoppable Garrosh with extra movement speed to catch an enemy.\n"},{"id":"51","name":"Leoric (Leoric)","builds":[{"name":"Wraith Walk Build","skills":"[T3331221,Leoric]"},{"name":"Basic Attacks Build","skills":"[T3321331,Leoric]"},{"name":"Drain Hope Build","skills":"[T3331111,Leoric]"}],"synergies":["Diablo (Diablo)","Orphea (Orféa)","Stukov (Stukov)"],"counters":["Dehaka (Dehaka)","Samuro (Samuro)","Tracer (Tracer)","Falstad (Falstad)","Ana (Ana)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Use Skeletal Swing to reduce the chance that Drain Hope will miss.\nDrain Hope is particularly effective when used on enemy Heroes with high maximum Health and who lack mobility.\nWraith Walk allows you to walk through enemy Gates, but not through the permanent unpassable terrain that forms the Battleground.\nWhen necessary, do not be afraid to trade your life for something else because you can respawn faster with Drain Essence, but remember you still give Experience for dying.\nWhile in Ghost Form, use Ghastly Swing to reduce the chance that Drain Essence will miss.\nRemember to Slow enemy Heroes and try to give vision to your team while you are in Ghost Form.\nWhen respawning is dangerous, you can use your Hearthstone while in Ghost Form.\n"},{"id":"52","name":"The Butcher (O Açougueiro)","builds":[{"name":"Ruthless Onslaught Build","skills":"[T1232222,TheButcher]"},{"name":"Hamstring Build","skills":"[T1112322,TheButcher]"}],"synergies":["Abathur (Abathur)","Tyrande (Tyrande)","Uther (Uther)","Tyrael (Tyrael)"],"counters":["Johanna (Johanna)","E.T.C. (C.T.E.)","Brightwing (Asaluz)","Uther (Uther)"],"strongerMaps":["Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Butcher's Brand should be used wisely, as it is The Butcher's only source of survivability. Do not use it as a source of damage.\nThe Butcher can target enemy minions or mercenaries with Ruthless Onslaught to escape enemy Heroes.\nRuthless Onslaught should be used primarily as a gap-closer, rather than as damage or crowd control.\nRuthless Onslaught makes The Butcher Unstoppable while charging. If timed correctly, he can avoid or negate key enemy abilities.\nAccumulate as much Fresh Meat as possible, but not at the expense of missing team fights or Battleground objectives.\nCast Furnace Blast early so that it explodes just as The Butcher reaches his target, giving the enemy team less time to react.\nDo not use Lamb to the Slaughter on Heroes that have abilities that can easily remove the chain.\nRoam as much as possible early in the match. This will help The Butcher quickly accumulate stacks of Fresh Meat.\n"},{"id":"53","name":"Johanna (Johanna)","builds":[{"name":"Iron Skin Build","skills":"[T2312122,Johanna]"},{"name":"Shield Glare Build","skills":"[T3312112,Johanna]"}],"synergies":["Blaze (Blaze)","Maiev (Maiev)","Hanzo (Hanzo)","Jaina (Jaina)","Deckard Cain (Deckard Cain)"],"counters":["Varian (Varian)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Damage and Slow adjacent enemies with Punish.\nCondemn can interrupt abilities like Muradin's Dwarf Toss or E.T.C.'s Mosh Pit.\nShield Glare enemies that deal significant Basic Attack damage.\nUse Blessed Shield to engage, buy time to flee, or to interrupt enemies that are channelling abilities.\nUse Iron Skin just prior to an enemy using crowd control on you.\n"},{"id":"54","name":"Kael'thas (Kael'thas)","builds":[{"name":"Standard Flamestrike Build","skills":"[T3111124,Kaelthas]"}],"synergies":["E.T.C. (C.T.E.)","Arthas (Arthas)","Malfurion (Malfurion)","Uther (Uther)"],"counters":["Illidan (Illidan)","Zeratul (Zeratul)","Kerrigan (Kerrigan)","Tracer (Tracer)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Since Kael'thas lacks any type of mobility, positioning is extremely important. Once an enemy Hero is attacking him, he must rely on his allies to assist him. Protect Kael'thas by being proactive and keeping a distance.\nVerdant Spheres should be used with Flamestrike when Kael'thas needs waveclear.\nGravity Lapse should only be empowered with Verdant Spheres to catch an enemy Hero hiding behind a minion or to stun multiple enemy Heroes.\nPhoenix can be used to zone enemy Heroes, kill Mercenaries, clear Minion waves, and to siege or defend Forts and Keeps. Its relatively low cooldown encourages Kael'thas to use it liberally.\nChannel Pyroblast behind walls or Kael'thas' frontline. Try to use it proactively and early in fights, rather than saving it to finish enemies off.\nGravity Lapse is difficult to hit. Take the time needed to land it, as Kael'thas is defenseless if it misses the desired target(s).\n"},{"id":"55","name":"Sylvanas (Sylvana)","builds":[{"name":"Sustained Basic Attack Build","skills":"[T1121314,Sylvanas]"},{"name":"Single-Target Burst Build","skills":"[T1131224,Sylvanas]"}],"synergies":["Diablo (Diablo)","E.T.C. (C.T.E.)","Jaina (Jaina)","Tassadar (Tassadar)","Tyrande (Tyrande)","Valla (Valla)"],"counters":["Chen (Chen)","Diablo (Diablo)","Genji (Genji)","Nova (Nova)","The Butcher (O Açougueiro)","Valeera (Valira)","Zeratul (Zeratul)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Withering Fire is extremely cheap; use it as often as possible if there are no enemy Heroes around.\nUse Shadow Dagger whenever it is available, but see to have it affect as many enemies as possible.\nHaunting Wave should almost exclusively be used only for its mobility, as it deals minimal damage.\nHold on to Wailing Arrow until you can hit many opponents or for when you need to prevent a Hero from saving another.\nUse Mind Control to move a key target away from their team, and into yours.\nBlack Arrows allows you to push down Structures without Minions; exploit this especially with allies and vehicles.\n"},{"id":"56","name":"The Lost Vikings (Os Vikings Perdidos)","builds":[{"name":"Standard Build","skills":"[T4222214,LostVikings]"}],"synergies":["Zarya (Zarya)","Garrosh (Garrosh)","Sylvanas (Sylvana)","Raynor (Raynor)","Sgt. Hammer (Sgt. Marreta)"],"counters":["Zagara (Zagara)","Sonya (Sonya)","Zeratul (Zeratul)","Nova (Nova)","Falstad (Falstad)","Dehaka (Dehaka)","Li-Ming (Li-Ming)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Stick with a passive playstyle in the early game so as not to miss out on minion experience or Regeneration Globes because of a Viking's death.\nWhen the opportunity arises, try to stack the damage of Spin To Win! on a single target to maximize the Vikings damage potential.\nDuring teamfights, Olaf's slow or stun from his charge should be used to provide peel for allied assassins. It can also be used to stun squishy enemies, if there is no threat towards your backline.\nTry to never stack the Vikings too closely during teamfights in order to not be immediately wiped by deadly AoE abilities such as Gazlowe's Grav-O-Bomb 3000 or Kael'thas's Living Bombs.\nIn the mid-to-late game when a single Viking is pressuring the enemy teams structures, an individual enemy Hero can be baited away from important teamfights using Play Again!.\nAlways be trying to integrate the ability to queue actions using the \"Shift\" key into your TLV play, as this will greatly increase the efficiency of your micro-managing.\n"},{"id":"57","name":"Thrall (Thrall)","builds":[{"name":"Chain Lightning Build","skills":"[T1322222,Thrall]"},{"name":"Feral Spirit Build","skills":"[T1222232,Thrall]"}],"synergies":["Diablo (Diablo)","Fenix (Fenix)","Chromie (Crona)","Rehgar (Rehgar)"],"counters":["Johanna (Johanna)","Arthas (Arthas)","Kael'thas (Kael'thas)","Lunara (Lunara)","Malfurion (Malfurion)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Blackheart's Bay (Baía do Coração Negro)","Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Hanamura Temple (Templo de Hanamura)","Sky Temple (Templo Celeste)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Chain Lightning can be used to dismount enemy Heroes or to poke them, especially valuable while they are channeling an Objective.\nFeral Spirit can be cast on Minions to easily trigger the heal from Frostwolf Resilience.\nWindfury can be used as a gap-closer or as an escape mechanism, other than for burst damage. If you want to use it for damage rather than utility, be sure that Thrall does not have any Blind effect on him.\nEarthquake synergizes very well with other area of effect Abilities (such as Apocalypse by Diablo), but also acts as a powerful engage by denying the enemy team's retreat.\nSundering is your only tool to interrupt channeled Heroic Abilities (for example Jug of 1,000 Cups by Li Li).\n"},{"id":"58","name":"Jaina (Jaina)","builds":[{"name":"Frostbolt Build","skills":"[T3112332,Jaina]"}],"synergies":["Arthas (Arthas)","E.T.C. (C.T.E.)","Johanna (Johanna)","Malfurion (Malfurion)","Muradin (Muradin)","The Butcher (O Açougueiro)","Valeera (Valira)","Varian (Varian)","Xul (Xul)"],"counters":["Alarak (Alarak)","Anub'arak (Anub'arak)","Chen (Chen)","Genji (Genji)","Nova (Nova)","Tracer (Tracer)","Valeera (Valira)","Zeratul (Zeratul)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Use your Abilities together to maximise Frostbite's damage.\nRoot or Slow enemies before casting Blizzard and Ring of Frost. Allied crowd control is also helpful.\nUse Blizzard to very efficiently waveclear or claim Mercenary Camps.\n"},{"id":"59","name":"Azmodan (Azmodan)","builds":[{"name":"Gluttony Build","skills":"[T2212113,Azmodan]"}],"synergies":["Jaina (Jaina)","Johanna (Johanna)","Maiev (Maiev)","Malfurion (Malfurion)"],"counters":["Artanis (Artanis)","Anub'arak (Anub'arak)","Diablo (Diablo)","Leoric (Leoric)","Malthael (Maltael)","Muradin (Muradin)","Sonya (Sonya)","The Butcher (O Açougueiro)"],"strongerMaps":["Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Warhead Junction (Junção da Ogiva)"],"tips":"Cast Demon Lieutenant whenever it is off-Cooldown; prioritise empty lanes with plenty of Minions, as the Ability has global range.\nCommunicate to your allies that you intend on stacking up Globe of Annihilation on a given Minion wave through Pings so that they may help you out or hold back on waveclearing.\nThe area of effect damage effect provided by Summon Demon Warrior can be helpful for stacking up Globe of Annihilation as well.\nKeep track of enemy crowd control so that Globe of Annihilation and All Shall Burn are not interrupted.\n"},{"id":"60","name":"Anub'arak (Anub'arak)","builds":[{"name":"Hardened Carapace Build","skills":"[T1212114,Anubarak]"},{"name":"Burrow Charge Build","skills":"[T1322114,Anubarak]"},{"name":"Scarab Host Build","skills":"[T2131234,Anubarak]"}],"synergies":["Greymane (Greymane)","Jaina (Jaina)","Kael'thas (Kael'thas)","Kerrigan (Kerrigan)","Rehgar (Rehgar)","The Butcher (O Açougueiro)"],"counters":["Leoric (Leoric)","Malthael (Maltael)","Tracer (Tracer)","Valla (Valla)","Varian (Varian)","Zul'jin (Zul'jin)"],"strongerMaps":["Dragon Shire (Condado do Dragão)"],"tips":"Exploit Scarab Host Beetles to soak damage from Structures and Mercenaries, and to intercept skillshots.\nUse Burrow Charge to close up on a target, then follow up with Impale for much crowd control.\nHarden Carapace should be used on-Cooldown during fights due to its low Mana cost and ability to summon Beetles.\nUse Locust Swarm with caution; it heals for a large amount, but does not make you invincible, especially versus burst damage.\nHold onto your Cocoon's Cooldown to interrupt and deny strong enemy Heroic Abilities.\n"},{"id":"61","name":"Chen (Chen)","builds":[{"name":"Basic Attacks Build","skills":"[T1232432,Chen]"}],"synergies":["Tyrael (Tyrael)","Greymane (Greymane)","Li-Ming (Li-Ming)","Abathur (Abathur)","Rehgar (Rehgar)"],"counters":["E.T.C. (C.T.E.)","Yrel (Yrel)","Raynor (Raynor)","Li-Ming (Li-Ming)","The Lost Vikings (Os Vikings Perdidos)","Lúcio (Lúcio)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Hanamura Temple (Templo de Hanamura)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Flying Kick can be used on any enemy unit, so you can target Minions or Walls to quickly go from danger to safety.\nAlways land a Basic Attack between Keg Smash and Breath of Fire to maximize your damage output.\nThe damage over time from Stagger can be mitigated with the Shield provided by Fortifying Brew or completely negated by Storm, Earth, Fire.\nOther than to escape from danger and contest a Control Point, Wandering Keg can be used to push a single enemy Hero towards your team and/or to push multiple enemy Heroes away from your team.\nImmediately after casting Storm, Earth, Fire, you can quickly use Storm and Fire to empower Earth for a strong engage.\n"},{"id":"62","name":"Rehgar (Rehgar)","builds":[{"name":"Earthbind Totem Build","skills":"[T2331324,Rehgar]"},{"name":"Lightning Shield Build","skills":"[T1332112,Rehgar]"},{"name":"Ghost Wolf Build","skills":"[T3332132,Rehgar]"}],"synergies":["Illidan (Illidan)","E.T.C. (C.T.E.)","Kerrigan (Kerrigan)","Thrall (Thrall)"],"counters":["Muradin (Muradin)","Varian (Varian)","Ana (Ana)","Tracer (Tracer)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Rehgar is surprisingly good at clearing Mercenary Camps all by himself.\nUsing Ghost Wolf's empowered Basic Attacks while fighting enemy Heroes or clearing Mercenary Camps increases your damage output significantly.\nIt is better to cast Ancestral Healing too early than too late. The more the enemy focuses on killing a single target of your team, the earlier you should cast Ancestral Healing on them.\nLightning Shield can be cast on Earthbind Totem to damage Minion waves from a safe distance.\n"},{"id":"63","name":"Zagara (Zagara)","builds":[{"name":"Infested Drop Build","skills":"[T2131111,Zagara]"},{"name":"Baneling Barrage Build","skills":"[T1112122,Zagara]"}],"synergies":["E.T.C. (C.T.E.)","Diablo (Diablo)","Jaina (Jaina)"],"counters":["Illidan (Illidan)","Falstad (Falstad)","Chen (Chen)","Zeratul (Zeratul)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Baneling Barrage should be used primarily for waveclear to conserve valuable mana.\nWhen using Baneling Barrage on Minion Waves, try using it from a 90 degree angle. Aim at the Wizard Minion to maximize splash damage.\nUse Hunter Killer to zone enemies from team fights or lane.\nAlways use Infested Drop when it is available to deal damage safely and provide vision. Infested Drop can also be used to tank Mercenary Camps and interrupt channeling of objectives (like Tributes on Cursed Hollow).\nDo not try to force Devouring Maw and instead wait for enemies to come into range.\nPlace Nydus Worms provided by Nydus Network in spots clear of heavy foot-traffic to prevent them from being immediately destroyed.\nAlways use all available Creep Tumors. Place them inside bushes and at other out-of-the-way locations to prevent the enemy from accidentally destroying them with AoE abilities.\n"},{"id":"64","name":"Murky (Murquinho)","builds":[{"name":"Slime Build","skills":"[T3111314,Murky]"},{"name":"Pufferfish Build","skills":"[T3222123,Murky]"}],"synergies":["Abathur (Abathur)","Deckard Cain (Deckard Cain)","Tassadar (Tassadar)","Zarya (Zarya)"],"counters":["Genji (Genji)","Li-Ming (Li-Ming)","Nova (Nova)","Tychus (Tychus)","Tracer (Tracer)","Zarya (Zarya)"],"strongerMaps":["Garden of Terror (Jardim do Terror)"],"tips":"Hide your Spawn Egg in nooks and crannies, Bushes, or near allied Structures so that it is difficult to find.\nUse Slime and Pufferfish to efficiently waveclear at all stages of the game.\nStanding on top of Pufferfish will prevent opponents from targeting it easily.\nTry and dodge dangerous skillshots or area of effect Abilities with Safety Bubble.\nCall out your intended Octo-Grab target so that your teammates know just who to focus down.\n"},{"id":"65","name":"Brightwing (Asaluz)","builds":[{"name":"Teleport Build","skills":"[T2221221,Brightwing]"},{"name":"Critical Mist Build","skills":"[T2331221,Brightwing]"},{"name":"Arcane Flare Build","skills":"[T2111211,Brightwing]"}],"synergies":["Diablo (Diablo)","Cho (Cho)","Stitches (Suturino)","Tracer (Tracer)","Genji (Genji)"],"counters":["Anub'arak (Anub'arak)","Johanna (Johanna)","E.T.C. (C.T.E.)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Cursed Hollow (Clareira Maldita)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Phase Shift allows Brightwing to split-soak experience very efficiently while also allowing her to join team fights in time.\nBlink Heal can be used to juke enemy Heroes and abilities.\nArcane Flare's casting range is larger than the shooting range of enemy Towers, Forts, and Keeps. Always follow Polymorph with it; the slow can guarantee the hit.\nPixie Dust becomes a crucial ability against Assassins like Jaina or Kael'thas to reduce their spell damage potential. Considering Pixie Dust's low cooldown, it is recommended to use it to mitigate spell damage at the start of the fight, because you will still have it available at the end.\nAgainst dive heroes like Zeratul or Genji, hold Polymorph until they dive towards an ally, since it will greatly reduce their effectiveness. However, it can also be used to guarantee kills of tanks with mobility, like on Muradin before he jumps out or on Anub'arak before he uses Burrow Charge to flee.\nEven though Soothing Mist's range relatively small, try to not be very close to your teammates to heal them. Always stay in a position in which the target you want to heal is close to the edge of your healing range, so you do not get damaged or controlled with them.\n"},{"id":"66","name":"Li Li (Li Li)","builds":[{"name":"Blinding Wind Build","skills":"[T2231123,LiLi]"},{"name":"Healing Brew Build","skills":"[T1211311,LiLi]"},{"name":"Cloud Serpent Build","skills":"[T2121133,LiLi]"}],"synergies":["Artanis (Artanis)","Anub'arak (Anub'arak)","Azmodan (Azmodan)","Varian (Varian)","Falstad (Falstad)"],"counters":["Alarak (Alarak)","Anub'arak (Anub'arak)","E.T.C. (C.T.E.)","Jaina (Jaina)"],"strongerMaps":[],"tips":"Use Healing Brew whenever it is available to heal allies.\nCloud Serpent should be used on frontline melee Heroes as they engage.\nUse Blinding Wind to Blind Heroes; avoid PvE use.\nActivate Jug of 1,000 Cups preemptively in team fights.\n"},{"id":"67","name":"Tychus (Tychus)","builds":[{"name":"Standard Build","skills":"[T3211331,Tychus]"},{"name":"Overkill Build","skills":"[T1211111,Tychus]"},{"name":"Grenade Build","skills":"[T1211321,Tychus]"}],"synergies":["Garrosh (Garrosh)","E.T.C. (C.T.E.)","Dehaka (Dehaka)","Uther (Uther)"],"counters":["Anub'arak (Anub'arak)","Johanna (Johanna)","Lúcio (Lúcio)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Infernal Shrines (Santuários Infernais)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Tychus cannot stutter-step, so use Overkill when you want to deal sustained AoE damage while moving.\nUse Frag Grenade to displace enemies that you are fleeing from or chasing, or to interupt channeled Abilities. Can be used during Overkill.\nUse Run and Gun to escape death, dodge harmful Abilities, or secure kills.\nActivate Minigun when attacking a Hero with a large Health pool, or who has been Stunned or Rooted.\nStart casting Overkill if you are blinded during Minigun, since its damage is not affected by blinds.\nPlace the Drakken Laser Drill off to the side of a fight so that it will not be destroyed immediately.\nUse Commandeer Odin just as a fight begins, when the enemy team cannot just run away from it.\nCommandeer Odin gives you unstoppable on cast for some seconds, while also giving 25 extra armor for the entire duration. Use it if you think you will be controlled for a long duration, or while Cocoon is going towards you.\n"},{"id":"68","name":"Abathur (Abathur)","builds":[{"name":"Symbiote Build","skills":"[T1131223,Abathur]"},{"name":"Toxic Nest Build","skills":"[T2311221,Abathur]"},{"name":"Locust Strain Build","skills":"[T4331344,Abathur]"}],"synergies":["Illidan (Illidan)","Zeratul (Zeratul)","Tracer (Tracer)","Greymane (Greymane)","Genji (Genji)","Malthael (Maltael)","Yrel (Yrel)","Sonya (Sonya)"],"counters":["Dehaka (Dehaka)","Falstad (Falstad)","Ragnaros (Ragnaros)","Zarya (Zarya)","Sylvanas (Sylvana)","Sgt. Hammer (Sgt. Marreta)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)"],"tips":"Symbiote can be used to absorb the XP from distant lanes and to assist your allies in combat.\nUse Symbiote to assure your team do not lose any experience from lanes they are not present.\nPlace Toxic Nests around the map to provide vision, deal damage, and dismount enemies who are rotating. Using them on enemy Mercenary camps is a great way to spot enemies frequently, allowing your team to invade it or to push somewhere else.\nAfter getting Soma Transference it is better to only use Spike Burst when there are many enemies inside the area of effect, since you should be always trying to maximize sustain healing in your empowered ally.\nUltimate Evolution should be used as team fights start.\nUse Deep Tunnel to quickly traverse the map and get out of harm's way.\nDeep Tunnel should be used towards empty lanes when enemies cannot reach them, so you will be soaking experience for your team with Abathur's body, while also assisting them with Symbiote.\nCalldown: MULE should be used when ready on any damaged lane to maximize the possible regeneration provided by it.\nYou should be careful about body position when playing against Heroes that can easily hunt you down, such as Zeratul, Medivh, or Genji. In those scenarios it might even be better to not be in lane at all while you do not know where they are.\n"},{"id":"69","name":"Arthas (Arthas)","builds":[{"name":"Frozen Tempest Build","skills":"[T1231121,Arthas]"}],"synergies":["Diablo (Diablo)","Tyrael (Tyrael)","Maiev (Maiev)","Greymane (Greymane)","Raynor (Raynor)","Chromie (Crona)","Zarya (Zarya)","Stukov (Stukov)","Rehgar (Rehgar)"],"counters":["Garrosh (Garrosh)","Sonya (Sonya)","Tracer (Tracer)","Raynor (Raynor)","Jaina (Jaina)","Ana (Ana)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)"],"tips":"Death Coil can be used on enemies to damage them or on Arthas to heal him, something that can be done faster by using the Self Cast Modifier [Alt] rather than by mouse-hovering Arthas.\nHowling Blast being a slow projectile requires you to predict the movements of enemy Heroes.\nFrozen Tempest reduces both Movement Speed and Attack Speed of enemy Heroes, making it particularly effective against melee Heroes who rely on Basic Attacks.\nFrostmourne Hungers resets the cooldown of your Basic Attack, so try to use it immediately after a Basic Attack goes off.\nArmy of the Dead can heal you on cooldown if you press R to cast it, then press and hold R for its duration.\nSummon Sindragosa disables enemy Structures, including the Healing Fountain, which can make it a very potent ability to use during pushes.\n"},{"id":"70","name":"Diablo (Diablo)","builds":[{"name":"Standard Build","skills":"[T1331314,Diablo]"},{"name":"Situational Build","skills":"[T1121114,Diablo]"}],"synergies":["Alexstrasza (Alexstrasza)","Deckard Cain (Deckard Cain)","Jaina (Jaina)","Maiev (Maiev)","Malfurion (Malfurion)","Medivh (Medivh)","Thrall (Thrall)","Tyrande (Tyrande)","Whitemane (Cristalba)"],"counters":["Leoric (Leoric)","Malthael (Maltael)","Raynor (Raynor)","Tychus (Tychus)"],"strongerMaps":["Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Remember that after reviving through Black Soulstone, your Health pool will be 30% smaller.\nFire Stomp can hit any given target up to five times in melee range.\nUse Overpower right after Shadow Charge to unconditionally move opponents towards your teammates.\nCast Lightning Breath when you suspect you may be the target of a crowd control chain, as it makes you Unstoppable for the duration.\nUse Apocalypse right before Shadow Charge and Overpower to unconditionally Stun your target.\n"},{"id":"71","name":"Illidan (Illidan)","builds":[{"name":"Flexible Build","skills":"[T2232314,Illidan]"},{"name":"Basic Attacks Build","skills":"[T2221331,Illidan]"}],"synergies":["Abathur (Abathur)","Medivh (Medivh)","Rehgar (Rehgar)","Tyrael (Tyrael)","Uther (Uther)","Zarya (Zarya)"],"counters":["Arthas (Arthas)","Brightwing (Asaluz)","E.T.C. (C.T.E.)","Li Li (Li Li)","Johanna (Johanna)","Muradin (Muradin)","Sonya (Sonya)","Uther (Uther)","Varian (Varian)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Cursed Hollow (Clareira Maldita)","Garden of Terror (Jardim do Terror)","Sky Temple (Templo Celeste)","Warhead Junction (Junção da Ogiva)"],"tips":"Dive always positions you directly behind your target; use this to body block and avoid area of effect Abilities.\nWith Friend or Foe, Dive can be utilized as an engage or escape tool. It is interesting to use it towards the enemy team, to proceed with Sweeping Strike to reach your target, resetting the Cooldown of Dive, to use it to retreat when enemies turn their focus on you.\nIllidan can use walls to retreat with Dive, to heal himself, or to reset his Cooldowns. It is recommended to not break them, since those can help you a lot.\nUsing Dive when capturing Mercenaries will only slow down the speed in which they are released. Only Sweeping Strike and Evasion should be used in Mercenary Camps.\nSweeping Strike does not require a target, unlike Dive, making it useful as an escape tool.\nEvasion also mitigates the damage from Structures and other non-Heroic entities.\nMetamorphosis's short Immaterial effect can and should optimally be used to quickly dodge Abilities.\nAlways use your Basic Attacks, even when out of combat, so as to heal and reduce the Cooldowns of your Abilities with Betrayer's Thirst.\nThe Hunt's near-global range opens up opportunities to split push.\nIllidan can ignore Core damage with Evasion and Betrayer's Thirst. You can go for the core even with enemies defending it, by using Sweeping Strike and Dive to move away from opposing Heroes while also finishing the game.\n"},{"id":"72","name":"Kerrigan (Kerrigan)","builds":[{"name":"Ravage Build","skills":"[T3121234,Kerrigan]"},{"name":"Combo Build","skills":"[T3221224,Kerrigan]"},{"name":"Primal Grasp Build","skills":"[T3321124,Kerrigan]"}],"synergies":["Tyrael (Tyrael)","Uther (Uther)","Medivh (Medivh)","Tyrande (Tyrande)"],"counters":["Tyrael (Tyrael)","E.T.C. (C.T.E.)","Garrosh (Garrosh)","Uther (Uther)","Medivh (Medivh)","Auriel (Auriel)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Kerrigan should always use her Basic Abilities wisely in order to conserve Mana.\nIn fights, always use Impaling Blades and Primal Grasp together. Use Primal Grasp to pull enemies into Impaling Blades' area-of-effect.\nPrimal Grasp will always pull enemies the same distance. Take this into account when placing Impaling Blades.\nRavage can be used on enemy Structures or summoned creatures to close the gap between enemy Heroes or to retreat from a compromised position.\nKerrigan excels with allied Heroes that can follow-up on her burst damage and crowd-control, however is weak against enemy teams with a strong frontline and lots of lockdown.\nKerrigan is a fantastic early-game Hero. Take advantage of this by ganking early and often by maintaining extreme aggression.\nAttempt to flank enemies whenever possible to take advantage of an enemy hero's poor positioning.\nEnemies will usually attempt to avoid Kerrigan's Primal Grasp/ Impaling Blades combo by side-stepping it preemptively. Use this to your advantage when pursuing them by holding onto Kerrigan's combo until her target puts themselves in a bad position, making her combo unavoidable.\nOnly use Primal Grasp and Ravage when clearing waves, since Impaling Blades is not necessary and costs more mana.\n"},{"id":"73","name":"Malfurion (Malfurion)","builds":[{"name":"Standard Build","skills":"[T1312124,Malfurion]"}],"synergies":["Blaze (Blaze)","Chromie (Crona)","Gul'dan (Gul'dan)","Jaina (Jaina)","Kael'thas (Kael'thas)","Kel'Thuzad (Kel'Thuzad)","Li-Ming (Li-Ming)","Nazeebo (Nazibo)","Ragnaros (Ragnaros)"],"counters":["Alarak (Alarak)","Anub'arak (Anub'arak)","Artanis (Artanis)","Jaina (Jaina)","Kerrigan (Kerrigan)","Li-Ming (Li-Ming)","Tracer (Tracer)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)"],"tips":"Innervate on Mana-hungry Heroes, notably, casters such as Kael'thas or Jaina, who can not function without Mana.\nKeep Regrowth up on as many targets as possible, even if they are at full Health.\nMoonfire is useful for quickly checking Bushes, dismounting or revealing opponents, and clearing Zagara's Creep Tumors.\nEntangling Roots is much easier to land on targets that have already been crowd controlled.\nKeep your Tranquility for heated team fights, where several teammates may require healing.\nTwilight Dream is an excellent counter-initiating tool, especially against multiple melee Heroes.\n"},{"id":"74","name":"Muradin (Muradin)","builds":[{"name":"Basic Attacks Build","skills":"[T1121334,Muradin]"}],"synergies":["Blaze (Blaze)","Kerrigan (Kerrigan)","Kael'thas (Kael'thas)","Hanzo (Hanzo)","Malfurion (Malfurion)"],"counters":["E.T.C. (C.T.E.)","Thrall (Thrall)","Raynor (Raynor)","Jaina (Jaina)","Malfurion (Malfurion)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Hanamura Temple (Templo de Hanamura)"],"tips":"Storm Bolt should be used with patience and combined with the Slow provided by Thunder Clap when possible.\nThunder Clap is a decent peeling tool, especially against melee Heroes who rely on Basic Attacks.\nDwarf Toss allows you to disengage when low Health, but be careful when the enemy Heroes have crowd control.\nAvatar is a maximum Health boost that protects you from burst damage but makes you vulnerable to percent damage.\nHaymaker should mostly be used for peeling away enemy Heroes rather than to engage by pushing enemy Heroes towards your team.\n"},{"id":"75","name":"Nazeebo (Nazibo)","builds":[{"name":"Zombie Wall Build","skills":"[T3222334,Nazeebo]"},{"name":"Corpse Spiders Build","skills":"[T1111334,Nazeebo]"}],"synergies":["Johanna (Johanna)","Raynor (Raynor)","Stukov (Stukov)"],"counters":["E.T.C. (C.T.E.)","Sylvanas (Sylvana)"],"strongerMaps":["Dragon Shire (Condado do Dragão)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"If you last-hit a Minion with Corpse Spiders, the Spiders can potentially run towards a nearby Hero.\nZombie Wall can be used to tank Structures.\nConsidering that Plague of Toads can be difficult to hit, use it on enemy Heroes coming towards you.\nWhen the Objective is not active, focus on Voodoo Ritual to unlock Vile Infection in the late game.\n"},{"id":"76","name":"Nova (Nova)","builds":[{"name":"Pinning Shot Build","skills":"[T1122224,Nova]"},{"name":"Snipe Build","skills":"[T1112112,Nova]"},{"name":"Holo Decoy Build","skills":"[T1122334,Nova]"}],"synergies":["Johanna (Johanna)","Blaze (Blaze)","Sylvanas (Sylvana)","Stukov (Stukov)"],"counters":["Chen (Chen)","Illidan (Illidan)","Johanna (Johanna)","Muradin (Muradin)","Tassadar (Tassadar)","Tyrael (Tyrael)","Zarya (Zarya)"],"strongerMaps":["Warhead Junction (Junção da Ogiva)"],"tips":"Practice often to acquire and maintain your Snipe accuracy. If you cannot reliably land Snipe, you cannot play Nova.\nSnipe stacks fall off only if you fail to hit anything at all, including Minions, Structures, and Mercenaries.\nUse Pinning Shot to make your Snipe and Precision Strike much easier to land.\nHolo Decoy is useful to to intercept dangerous skillshots.\nAn opposing Keep is nearly destroyed, but your team cannot quite get to it? Try Precision Strike.\n"},{"id":"77","name":"Raynor (Raynor)","builds":[{"name":"Standard Auto Attack Build","skills":"[T3122314,Raynor]"}],"synergies":["E.T.C. (C.T.E.)","Garrosh (Garrosh)","Thrall (Thrall)","Lt. Morales (Ten. Morales)"],"counters":["Johanna (Johanna)","Artanis (Artanis)","Cassia (Cássia)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)"],"tips":"Movement is crucial when playing Raynor, since he lacks any gap-closing abilities. Thus, make sure to constantly keep stutter stepping in between each Basic Attack even while fighting Minions in lane.\nYou can manually reassign a new target to your Banshee by hovering your cursor over the desired target and pressing R again.\nPenetrating Round can be used to knock enemies away from you. It can also be used to knock enemies towards your teammates.\nInspire also works on Minions and Mercenaries. Use it during pushes to take down enemy Structures more quickly.\n"},{"id":"78","name":"Sgt. Hammer (Sgt. Marreta)","builds":[{"name":"Standard Build","skills":"[T2221334,SgtHammer]"}],"synergies":["E.T.C. (C.T.E.)","Johanna (Johanna)","Lt. Morales (Ten. Morales)","Ana (Ana)"],"counters":["Artanis (Artanis)","Chromie (Crona)","Kel'Thuzad (Kel'Thuzad)","Li-Ming (Li-Ming)","Stitches (Suturino)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)"],"tips":"Be careful with Siege Mode; although its damage increase may be tempting, it also leaves you very vulnerable to area of effect Abilities.\nUse Thrusters sparingly; they are your only reliable method of escaping opponents.\nUse Spider Mines on-Cooldown to protect your flanks. Keep them away from Minions to preserve them.\nConcussive Blast deals very little damage; use it to push enemies away from you or teammates.\nNeosteel Plating should be used to avoid Ability-based burst damage such as an impending Pyroblast hit.\nNapalm Strike is useful for quickly checking Brushes, dismounting or revealing opponents, and clearing Zagara's Creep Tumors.\n"},{"id":"79","name":"Sonya (Sonya)","builds":[{"name":"Single Target Build","skills":"[T2332323,Sonya]"},{"name":"Whirlwind Build","skills":"[T3222334,Sonya]"},{"name":"Leap Build","skills":"[T1311211,Sonya]"}],"synergies":["Jaina (Jaina)","Medivh (Medivh)","Rehgar (Rehgar)","Zarya (Zarya)"],"counters":["Brightwing (Asaluz)","E.T.C. (C.T.E.)","Muradin (Muradin)","Diablo (Diablo)","Garrosh (Garrosh)","Sylvanas (Sylvana)","Tychus (Tychus)"],"strongerMaps":["Blackheart's Bay (Baía do Coração Negro)","Braxis Holdout (Resistência de Braxis)","Dragon Shire (Condado do Dragão)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)"],"tips":"As Fury does not decay over time, try and keep it full before impending engagements.\nAncient Spear is Sonya's most important Ability; avoid wasting it unless you are sure you can land it.\nTry and constantly keep on attacking while under the effects of Wrath of the Berserker to maintain its effects for as long as possible.\nSonya has a great potential to destroy Towers and Forts; make sure to damage the towers with Seismic Slams and Basic Attacks when the opposing solo laner is not there.\nSince Wrath of the Berserker's Cooldown runs during its buff, you can freely use this Heroic Ability in the Lane, as you will probably have it again when necessary.\n"},{"id":"80","name":"Tyrael (Tyrael)","builds":[{"name":"Standard Build","skills":"[T2232212,Tyrael]"},{"name":"Sword of Justice Build","skills":"[T2232122,Tyrael]"}],"synergies":["Blaze (Blaze)","Illidan (Illidan)","Malfurion (Malfurion)"],"counters":["Garrosh (Garrosh)","E.T.C. (C.T.E.)","Zeratul (Zeratul)","Greymane (Greymane)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Use your abilities wisely while laning. If you are not careful, Tyrael will run out of Mana very quickly.\nSince Tyrael is not as durable as some of the other Tanks, make sure to use his outstanding mobility to mitigate damage by dodging abilities.\nEl'druin's Might can be used to juke opponents while Tyrael is on the retreat.\nIf you play with Sanctification, save it for the enemy team's most dangerious abilities and track their Cooldowns accordingly. It can also be used when diving with your full-health allies, since it will make them immune to any crowd control, reducing the peeling options from enemy team.\nTyrael's Holy Ground can steal Mercenary and Boss Camps if its projectile is aimed at the very center of the capture platform.\n"},{"id":"81","name":"Tyrande (Tyrande)","builds":[{"name":"Standard Build","skills":"[T2311213,Tyrande]"},{"name":"Ranger Build","skills":"[T1311223,Tyrande]"}],"synergies":["Diablo (Diablo)","E.T.C. (C.T.E.)","Varian (Varian)","Anub'arak (Anub'arak)","Li-Ming (Li-Ming)"],"counters":["Anub'arak (Anub'arak)","Muradin (Muradin)","Zeratul (Zeratul)","Maiev (Maiev)","Fenix (Fenix)","Lunara (Lunara)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)","Dragon Shire (Condado do Dragão)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)"],"tips":"Use Sentinel as frequently as possible. The vision it provides helps your team in making better decisions.\nAlways mind your positioning when playing Tyrande. If caught by surprise, she is an easy Hero to get taken down.\nShadowstalk is an incredibly versatile Heroic Ability. Use it to ambush the enemy team or to cover your retreat.\nLanding Lunar Flare on moving targets requires practice and experience. Try to anticipate their movement paths and aim accordingly.\nHunter's Mark can be used on non-Heroic targets, such as Bosses, Immortals, or Punishers, in order to kill them faster.\nTo make the most out of your healing, you should be always using basic attacks. In many situations it will be dangerous to do so, and you should be waiting for enemy tank to use his Abilities to start delivering Basic Attacks.\nStarfall will greatly reduce Light of Elune's Cooldown. Be ready to use it quickly to not waste any healing.\nAll of Light of Elune's charges are refilled together, so you can have 1 charge left and start attacking. Use it right before the Cooldown comes back again, giving you 3 uses of the Ability. This is mostly useful against burst damage to surprise your enemies.\n"},{"id":"82","name":"Uther (Uther)","builds":[{"name":"Holy Radiance Build","skills":"[T2231233,Uther]"},{"name":"Holy Light Build","skills":"[T1132113,Uther]"},{"name":"Hammer of Justice Build","skills":"[T3132233,Uther]"}],"synergies":["Kerrigan (Kerrigan)","Illidan (Illidan)","The Butcher (O Açougueiro)","Zul'jin (Zul'jin)"],"counters":["Gul'dan (Gul'dan)","Lunara (Lunara)","Malthael (Maltael)","Nazeebo (Nazibo)","Sylvanas (Sylvana)","Zagara (Zagara)"],"strongerMaps":["Infernal Shrines (Santuários Infernais)"],"tips":"Holy Light is expensive and has a long Cooldown; use it sparingly, and against targets currently being focused down.\nHoly Radiance is an effective way of applying Devotion's Armor-granting effect to several allies at once, including oneself.\nUse Hammer of Justice against high-priority targets that must be crowd controlled or have crowd control on them that is about to expire.\nDivine Shield has broadly different offensive and defensive uses; pay attention to your enemy's and your own team compositions to find out who the aggressor should be.\nDivine Storm should be used along Hammer of Justice to lock down key targets for an extended period of time. Space out using the two Abilities to make the most out of their stun duration.\nDeath is not the end for Uther; remember to use Devotion to heal allies even after falling in battle yourself. Your sacrifice may even be worthwhile should you be out of Mana...\n"},{"id":"83","name":"Valla (Valla)","builds":[{"name":"Standard Build","skills":"[T3212234,Valla]"},{"name":"Burst Build","skills":"[T1132134,Valla]"},{"name":"Attack Build","skills":"[T3322234,Valla]"}],"synergies":["Arthas (Arthas)","E.T.C. (C.T.E.)","Tassadar (Tassadar)","Uther (Uther)"],"counters":["Greymane (Greymane)","Illidan (Illidan)","Nova (Nova)","The Butcher (O Açougueiro)","Valeera (Valira)","Zeratul (Zeratul)"],"strongerMaps":["Battlefield of Eternity (Campo de Batalha da Eternidade)"],"tips":"Hatred empowers Valla's Basic Attacks and increases her movement speed; try and attack something at least once every 5 seconds so that your stacks do not fall off.\nHungering Arrow has a high Mana cost and will home unto undesirable targets, such as Minions and Summons; avoid using the Ability unless it is going to deal useful damage.\nMultishot is your main waveclearing tool. Its wide area of effect also makes it excellent for checking hidden areas, revealing Stealthed Heroes, and dismounting opponents.\nVault can be used offensively, as a gap-closer, and defensively, to create space between yourself and opponents and dodge Abilities. Limit your offensive use of the Ability, as it leaves you vulnerable.\nStrafe's reliability goes up as opponents use up their crowd control Abilities; keep track of their Cooldowns, and remain on the move so as to minimise the chance you will be interrupted.\nRain of Vengeance is better used as a follow-up or as a self-peeling tool than merely for dealing damage.\n"},{"id":"84","name":"Zeratul (Zeratul)","builds":[{"name":"Death Sentence Build","skills":"[T3221231,Zeratul]"},{"name":"Void Prison Build","skills":"[T1122224,Zeratul]"},{"name":"Basic Attacks Build","skills":"[T2211213,Zeratul]"},{"name":"Cleave Build","skills":"[T1221221,Zeratul]"}],"synergies":["Abathur (Abathur)","Diablo (Diablo)","Garrosh (Garrosh)","Malfurion (Malfurion)","Kharazim (Kharazim)","Jaina (Jaina)","Li-Ming (Li-Ming)","Junkrat (Junkrat)","Hanzo (Hanzo)"],"counters":["Brightwing (Asaluz)","Uther (Uther)","Varian (Varian)","Diablo (Diablo)","E.T.C. (C.T.E.)","Medivh (Medivh)"],"strongerMaps":["Cursed Hollow (Clareira Maldita)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Towers of Doom (Torres da Perdição)"],"tips":"Cleave is excellent at clearing large Minion waves and Mercenary Camps.\nSingularity Spike provides a massive slowing effect; use it to deliver several Basic Attacks against your target.\nBlink is your main survival tool; only initiate combat with it when it is safe to do so.\nUse Void Prison to setup combos with your allies by hitting several enemy Heroes, or to split the enemy team in half.\nVoid Prison can be recast to be canceled. Reactivate it when your team's abilities are about to hit a target inside it.\nPermanent Cloak does not make you Invisible; merely translucent. Keen players will see you coming. To become truly Invisible, stand still for 1.5 seconds.\nBlink, Vorpal Blade, and Seeker in the Dark's blink disjoint all incoming projectiles. This can be used to avoid Basic Attacks or tower shots while diving.\nWormhole has a 1.25-second time window in which you cannot blink backwards. However, it can be compensated by only leaving stealth to use abilities once this time has passed (helps against targeted crowd controls). Might Of The Nerazim can be used during this period to cast a second Blink, dodging dangerous skillshots.\nWith Void Slash at Level 16, Vorpal Blade has the same duration as Cleave's Cooldown. If the marked target gets to low life, you can wait 3 seconds to use Vorpal towards them, finishing it with a second Cleave.\nWithout wasting your Blink in a fight, Might Of The Nerazim can be used as a Blink to reposition. Therefore, it is a good practice to use your normal Blink before a fight, so Might Of The Nerazim will be ready to teleport you when it starts. By doing this, it will be easier to embrace a good opportunity without wasting your main escape tool.\nVoid Prison can be used over Sanctification, freezing all Heroes inside, denying Tyrael's Heroic Ability.\n"},{"id":"85","name":"E.T.C. (C.T.E.)","builds":[{"name":"Standard Build","skills":"[T3211215,ETC]"}],"synergies":["Falstad (Falstad)","Greymane (Greymane)","Jaina (Jaina)","Kael'thas (Kael'thas)","Nazeebo (Nazibo)","Rehgar (Rehgar)","The Butcher (O Açougueiro)"],"counters":["Auriel (Auriel)","Brightwing (Asaluz)","Johanna (Johanna)","Leoric (Leoric)","Malthael (Maltael)","Raynor (Raynor)","Tyrande (Tyrande)","Valla (Valla)"],"strongerMaps":[],"tips":"Use Powerslide along with Face Melt to easily push opponents towards or away from your teammates.\nMake the best out of Rockstar's Armor by using Guitar Solo whenever you are being attacked.\nCapitalise on Stage Dive's global range to split push or soak Experience.\nKeep track of enemy crowd control so that Mosh Pit is not interrupted.\n"},{"id":"86","name":"Falstad (Falstad)","builds":[{"name":"Basic Attacks Build","skills":"[T2322332,Falstad]"},{"name":"Tailwind Build","skills":"[T3322222,Falstad]"},{"name":"Lightning Rod Build","skills":"[T3132132,Falstad]"}],"synergies":["Arthas (Arthas)","E.T.C. (C.T.E.)","Tassadar (Tassadar)","Uther (Uther)"],"counters":["Genji (Genji)","Greymane (Greymane)","Illidan (Illidan)","Nova (Nova)","Valeera (Valira)","Zeratul (Zeratul)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Cursed Hollow (Clareira Maldita)","Dragon Shire (Condado do Dragão)","Hanamura Temple (Templo de Hanamura)","Towers of Doom (Torres da Perdição)","Warhead Junction (Junção da Ogiva)"],"tips":"Capitalize on Flight's global range to split push or soak Experience. It can also be used to gank.\nUsing Hammerang and Hinterland Blast against targets under crowd control will greatly improves your accuracy. Nothing beats practice, however.\nLimit your offensive use of Barrel Roll, as it leaves you vulnerable.\nUse Mighty Gust to disengage a losing battle, to split the opposing forces in half, push your enemies into your team for blocking their retreat, or steal Capture Points.\n"},{"id":"87","name":"Gazlowe (Gasganete)","builds":[{"name":"Standard Build","skills":"[T2112222,Gazlowe]"},{"name":"Xplodium Build","skills":"[T1222324,Gazlowe]"}],"synergies":["Diablo (Diablo)","E.T.C. (C.T.E.)","Jaina (Jaina)","Johanna (Johanna)","Kael'thas (Kael'thas)","Malfurion (Malfurion)"],"counters":["Raynor (Raynor)","Lunara (Lunara)","Gul'dan (Gul'dan)","Chromie (Crona)","Hanzo (Hanzo)","Li-Ming (Li-Ming)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Braxis Holdout (Resistência de Braxis)","Infernal Shrines (Santuários Infernais)","Sky Temple (Templo Celeste)","Volskaya Foundry (Fundição Volskaya)","Warhead Junction (Junção da Ogiva)"],"tips":"Wait for enemies to line up or to be controlled before using Deth Lazor, so you get more healing.\nUse Rock-It! Turret to soak damage from Structures and Mercenaries, as needed.\nRock-It! Turret will block skillshots going towards you. It is excellent to use them to protect yourself against premeditated abilities, like Stitches's Hook or Muradin's Storm Bolt.\nCombo Grav-O-Bomb 3000 and Xplodium Charge together for a powerful AoE crowd control effect.\nDuring important fights it will be better to hold Xplodium Charge until a teammate stuns or root someone, so you can use it as a follow up ability, guaranteeing the hit.\nWith Rock It Sock It you should not use all your turrets instantly, since the shields will overlap, reducing your effective health. Only use a turret if the shield from previous one has already been destroyed or has expired.\nDue to how low Rock-It! Turret's damage is, turrets can be used to dismount and scout enemy rotations, instead of using it in the wave.\n"},{"id":"88","name":"Stitches (Suturino)","builds":[{"name":"Putrid Bile Build","skills":"[T3231313,Stitches]"},{"name":"Gorge Build","skills":"[T3232113,Stitches]"}],"synergies":["Blaze (Blaze)","Falstad (Falstad)","Kael'thas (Kael'thas)","Malfurion (Malfurion)"],"counters":["Johanna (Johanna)","Malthael (Maltael)","Greymane (Greymane)","Tychus (Tychus)","Anduin (Anduin)"],"strongerMaps":["Alterac Pass (Garganta de Alterac)","Cursed Hollow (Clareira Maldita)","Hanamura Temple (Templo de Hanamura)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Towers of Doom (Torres da Perdição)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Hook can be used to interrupt any kind of channeling.\nHelping Hand shares its cooldown with Hook, but it will be halved when hitting allied Heroes.\nSlam is a great tool for dismounting enemy Heroes and for waveclearing.\nDevour should not be used when Stitches has more than 80% of his maximum Health, else you will waste part of its effect, unless you want to use it to secure a kill.\nVile Cleaver damages enemies after receiving Basic Attacks; consistently attacking the same target re-applies its damage.\nPutrid Bile helps you to engage, peel, or disengage.\nGorge can be used to bring enemy Heroes behind your Gates, resulting in easy kills with the help of your Structures shooting at them.\n"},{"id":"89","name":"Tassadar (Tassadar)","builds":[{"name":"Shock Ray Build","skills":"[T1331331,Tassadar]"},{"name":"Psionic Storm Build","skills":"[T2221121,Tassadar]"}],"synergies":["Maiev (Maiev)","Johanna (Johanna)","E.T.C. (C.T.E.)","Genji (Genji)","Zeratul (Zeratul)"],"counters":["Tracer (Tracer)","Greymane (Greymane)","Zeratul (Zeratul)","Anub'arak (Anub'arak)","Kerrigan (Kerrigan)"],"strongerMaps":["Braxis Holdout (Resistência de Braxis)","Garden of Terror (Jardim do Terror)","Infernal Shrines (Santuários Infernais)","Tomb of The Spider Queen (Tuma da Aranha Rainha)","Volskaya Foundry (Fundição Volskaya)"],"tips":"Shock Ray can be used from bushes or vents so enemies do not see the channeling, and consequently do not dodge it.\nShock Ray is a slow Ability, so we recommend using it to follow slows or aim it towards a target leaving Psionic Storm.\nIf your team is retreating, remember that Psionic Storm can be used to dismount pursuing enemies.\nResonance Beam is you main way to regen your mana. When it starts to run out, you can start only using Psionic Storm to clear the wave, while keeping Resonance Beam up.\nArchon can be used to peel yourself; 40% of your health as shields may save you in many situations.\n"}]